Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/apidoc.po
Languages: ru

source: API Reference
ru: Описание API

source: When the periodic function executes longer then execution interval a next call will be skipping and warning will be logged.
ru: Когда периодическая функция выполняется дольше, чем интервал выполнения, следующий вызов будет пропущен, и будет залогировано предупреждение.

source: Clean-up the resources associated with the Executor.
ru: Очищает ресурсы, связанные с Executor.

source: It is safe to call this method several times. Otherwise, no other methods can be called after this one.
ru: Этот метод можно безопасно вызывать несколько раз. В противном случае после этого нельзя будет вызывать другие методы.

source: Args:
ru: Аргументы:

source: wait: If True then shutdown will not return until all running
ru: wait: Если True то функция не завершится пока выключение не будет произведено

source: futures have finished executing and the resources used by the executor have been reclaimed.
ru: исполнение Future завершено, а ресурсы, используемые executor, возвращены.

source: cancel_futures: If True then shutdown will cancel all pending
ru: cancel_futures: Если True то все отменяются все не завершенные

source: futures. Futures that are completed or running will not be cancelled.
ru: футуры. Футуры, которые завершены или запущены, не будут отменены.

source: Submit blocking function to the pool
ru: Отправляет блокирующуюся функцию в пул

source: Parameters
ru: Параметры

source: Returns
ru: Возвращаемое значение

source: Patametric decorator that ensures that ``attempt_timeout`` and ``deadline`` time limits are met by decorated function.
ru: Параметрический декоратор, который гарантирует, что ограничение ``attempt_timeout`` и ``deadline`` соблюдены декорируемой функцией.

source: In case of exception function will be called again with similar arguments after ``pause`` seconds.
ru: В случае возникновения исключения функция будет вызвана снова с аналогичными аргументами через ``pause`` секунд.

source: name filed for statistic instances
ru: имя для экземпляров статистики

source: is maximum execution time for one execution attempt.
ru: это максимальное время выполнения для одной попытки выполнения.

source: is maximum execution time for all execution attempts.
ru: это максимальное время выполнения для всех попыток выполнения.

source: is time gap between execution attempts.
ru: это пауза между попытками выполнениями.

source: retrying when this exceptions was raised.
ru: повторять только если брошены перечисленные тут исключения.

source: similar as exc but keyword only.
ru: тоже самое что и exc но это именованный аргумент.

source: is maximum count of execution attempts (>= 1).
ru: это максимальныое количество попыток исполнения (>= 1).

source: is a predicate function which can decide by a given
ru: это функция-предикат, которая может принимать решение нужно ли продолжать попытки

source: statistic class
ru: класс статистики

source: Shortcut of ``asyncbackoff(None, None, 0, Exception)``.
ru: Аналог ``asyncbackoff(None, None, 0, Exception)``.

source: is maximum count of execution attempts (>= 1 or ``None`` means infinity).
ru: это максимальныое количество попыток исполнения (>= 1 или ``None`` бесконечность).

source: Decorator wraps function and returns a function which returns awaitable object. In case than a function returns a future, the original future will be returned. In case then the function returns a coroutine, the original coroutine will be returned. In case than function returns non-awaitable object, it's will be wrapped to a new coroutine which just returns this object. It's useful when you don't want to check function result before use it in ``await`` expression.
ru: Декоратор оборачивает функцию и возвращает функцию, которая возвращает awaitable объект. В случае, если функция возвращает ``Future``, будет возвращено исходная ``Future``. В случае, если функция возвращает корутину, будет возвращена исходная корутина. В случае, если функция возвращает не awaitable объект, он будет перенесен в новую корутину, которая просто возвращает этот объект. Это полезно, когда вы не хотите проверять результат функции перед использованием его в выражении ``await``.

source: Bind socket and set ``setblocking(False)`` for just created socket. This detects ``address`` format and select socket family automatically.
ru: Свяжите сокет и установите ``setblocking (False)`` для только что созданного сокета. Это определяет формат ``адреса`` и автоматически выбирает тип сокета (IPv4 или IPv6).

source: which will be passed to stdlib's socket constructor (optional)
ru: который будет передан конструктору сокета stdlib (необязательно)

source: bind address
ru: биндит адрес

source: bind port
ru: биндит порт

source: Tuple of pairs which contain socket option to set and the option value.
ru: Кортэж пар, содержащих параметр сокета, который необходимо установить, и значение этого параметра.

source: set socket.SO_REUSEADDR
ru: устанавливает socket.SO_REUSEADDR

source: set socket.SO_REUSEPORT
ru: устанавливает socket.SO_REUSEPORT

source: protocol name which will be logged after binding
ru: название протокола, оно будет залогировано после биндинга

source: All passed tasks will be cancelled and a new task will be returned.
ru: Все переданные задачи будут отменены. Функция вернет новую задачу.

source: tasks which will be cancelled
ru: отменяемые задачи

source: Split list or generator by chunks with fixed maximum size.
ru: Разделяет список или генератор по пачкам с фиксированным максимальным размером.

source: awaitable objects
ru: awaitable объект

source: if True exception will not be raised just returned as result
ru: Если True то исключение не боросается а возвращается как результат

source: cancel unfinished coroutines (default True)
ru: отменять ли незавершенные корутины (по умолчанию True)

source: execution timeout
ru: таймаут выполнения

source: when False and ``cancel=True``, unfinished coroutines will be cancelled in the background.
ru: Если False и ``cancel=True``, незавершенные корутины будут отменены в фоне.

source: Simple and useful decorator for wrap the coroutine to `asyncio.shield`.
ru: Простой и полезный декоратор для переноса сопрограммы в ``asyncio.shield``.
