Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/async_backoff.po
Languages: ru

source: ``asyncbackoff`` it's a decorator that helps you guarantee maximal async function execution and retrying policy.
ru: ``asyncbackoff `` декоратор который обеспечивает политику повторов и политику максимального количества повторных попыток выполнения асинхронной функции.

source: The main principle might be described in five rules:
ru: Основной принцип может быть описан пятью правилами:

source: function will be canceled when executed longer than ``deadline`` (if specified)
ru: функция будет отменена, если она будет выполнена дольше, чем ``deadline`` (если указано)

source: function will be canceled when executed longer than ``attempt_timeout`` (if specified) and will be retried
ru: функция будет отменена при выполнении дольше, чем ``attempt_timeout` (если указано) после этого будет выполнена повторная попытка.

source: Reattempts performs after ``pause`` seconds (if specified, default is ``0``)
ru: Попытки выполняются после ``pause`` секунд (если указано, по умолчанию ``0``)

source: Reattempts will be performed not more than ``max_tries`` times.
ru: Попытки будут выполняться не более ``max_tries`` раз.

source: ``giveup`` argument is a function that decides should give up the reattempts or continue retrying.
ru: аргумент ``giveup`` - это функция, которая решает, следует ли "сдаться" и прекратить дальнейшие попыток или продолжать.

source: All these rules work at the same time.
ru: Все эти правила работают одновременно.

source: Arguments description:
ru: Описание аргументов:

source: ``attempt_timeout`` is maximum execution time for one execution attempt.
ru: ``attempt_timeout`` максимально допустимое время выполнения одной попытки.

source: ``deadline`` is maximum execution time for all execution attempts.
ru: ``deadline`` максимально допустимое время выполнения всех попыток.

source: ``pause`` is the time gap between execution attempts.
ru: ``pause`` промежуток времени между попытками.

source: ``exceptions`` retrying when these exceptions were raised.
ru: ``exceptions`` делает последующие попытки только если эти будут брошены эти исключения.

source: ``giveup`` (keyword only) is a predicate function that can decide by a given exception if we should continue to do retries.
ru: ``giveup`` (именовынный аргумент) это функция-предикат, которая может решить по данному исключению, следует ли нам продолжать повторять попытки.

source: ``max_tries`` (keyword only) is maximum count of execution attempts (>= 1).
ru: ``max_tries`` (именовынный аргумент) - максимальное количество попыток (> = 1).

source: Decorator that ensures that ``attempt_timeout`` and ``deadline`` time limits are met by decorated function.
ru: Декоратор, обеспечивающий соблюдение временных ограничений "attempt_timeout" и "deadline" декорированной функцией.

source: In case of exception, the function will be called again with similar arguments after ``pause`` seconds.
ru: В случае возникновения исключения функция будет вызвана снова с аналогичными аргументами через кол-во секунд переданное в аргументе "pause".

source: Position arguments notation:
ru: Объявление через позиционные аргументы:

source: import aiomisc attempt_timeout = 0.1 deadline = 1 pause = 0.1 @aiomisc.asyncbackoff(attempt_timeout, deadline, pause) async def db_fetch(): ... @aiomisc.asyncbackoff(0.1, 1, 0.1) async def db_save(data: dict): ... # Passing exceptions for handling @aiomisc.asyncbackoff(0.1, 1, 0.1, TypeError, RuntimeError, ValueError) async def db_fetch(data: dict): ...
ru: import aiomisc attempt_timeout = 0.1 deadline = 1 pause = 0.1 @aiomisc.asyncbackoff(attempt_timeout, deadline, pause) async def db_fetch(): ... @aiomisc.asyncbackoff(0.1, 1, 0.1) async def db_save(data: dict): ... # Передаем список исключений @aiomisc.asyncbackoff(0.1, 1, 0.1, TypeError, RuntimeError, ValueError) async def db_fetch(data: dict): ...

source: Keyword arguments notation:
ru: Объявление через именованные аргументы

source: import aiomisc attempt_timeout = 0.1 deadline = 1 pause = 0.1 @aiomisc.asyncbackoff(attempt_timeout=attempt_timeout, deadline=deadline, pause=pause) async def db_fetch(): ... @aiomisc.asyncbackoff(attempt_timeout=0.1, deadline=1, pause=0.1) async def db_save(data: dict): ... # Passing exceptions for handling @aiomisc.asyncbackoff(attempt_timeout=0.1, deadline=1, pause=0.1, exceptions=[TypeError, RuntimeError, ValueError]) async def db_fetch(data: dict): ... # Will be retried no more than 2 times (3 tries total) @aiomisc.asyncbackoff(attempt_timeout=0.5, deadline=1, pause=0.1, max_tries=3, exceptions=[TypeError, RuntimeError, ValueError]) async def db_fetch(data: dict): ... # Will be retried only on connection abort (on POSIX systems) @asyncbackoff(attempt_timeout=0.5, deadline=1, pause=0.1, exceptions=[OSError], giveup=lambda e: e.errno != errno.ECONNABORTED) async def db_fetch(data: dict): ...
ru: import aiomisc attempt_timeout = 0.1 deadline = 1 pause = 0.1 @aiomisc.asyncbackoff(attempt_timeout=attempt_timeout, deadline=deadline, pause=pause) async def db_fetch(): ... @aiomisc.asyncbackoff(attempt_timeout=0.1, deadline=1, pause=0.1) async def db_save(data: dict): ... # Передаем список исключений @aiomisc.asyncbackoff(attempt_timeout=0.1, deadline=1, pause=0.1, exceptions=[TypeError, RuntimeError, ValueError]) async def db_fetch(data: dict): ... # Будет повторено не больше чем 2 раза (всего 3 попытки) @aiomisc.asyncbackoff(attempt_timeout=0.5, deadline=1, pause=0.1, max_tries=3, exceptions=[TypeError, RuntimeError, ValueError]) async def db_fetch(data: dict): ... # Повторы будут только если соединение было сброшено (только POSIX системы) @asyncbackoff(attempt_timeout=0.5, deadline=1, pause=0.1, exceptions=[OSError], giveup=lambda e: e.errno != errno.ECONNABORTED) async def db_fetch(data: dict): ...

source: Shortcut of ``asyncbackoff(None, None, 0, *args, **kwargs)``. Just retries ``max_tries`` times.
ru: Аналог ``asyncbackoff(None, None, 0, *args, **kwargs)``. Прсто повторяет выполнение функции ``max_tries`` раз.

source: By default will be retry when any Exception. It's very simple and useful in generic cases, but you should specify an exception list when you're wrapped functions calling hundreds of times per second, cause you have a risk be the reason for denial of service in case your function calls remote service.
ru: По умолчанию будет повторена попытка при любом исключении. Это очень просто и полезно в общих случаях, при этом следует указать список исключений тогда, когда обернутые функции вызывают сотни раз в секунду, потому что у вас есть риск быть причиной отказа в обслуживании в случае, если ваша функция вызывает какой-то сервис по сети.
