Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/circuit_breaker.po
Languages: ru

source: Circuit Breaker
ru: Предохранитель

source: `Circuit breaker is a design pattern`_ used in software development. It is used to detect failures and encapsulates the logic of preventing a failure from constantly recurring, during maintenance, temporary external system failure, or unexpected system difficulties.
ru: `Предохранитель - это шаблон проектирования`_, используемый при разработке программного обеспечения. Он используется для обнаружения сбоев и инкапсулирует логику предотвращения постоянного повторения сбоя во время обслуживания, временного сбоя внешней системы или неожиданных системных проблем.

source: The following example demonstrates the simple usage of the current implementation of ``aiomisc.CircuitBreaker``. An instance of ``CircuitBreaker`` collecting function call statistics. That contains counters mapping with successful and failed function calls. Function calls must be wrapped by the `CircuitBreaker.call` the method to gather it.
ru: Следующий пример демонстрирует простое использование текущей реализации ``aiomisc.CircuitBreaker``. Экземпляр ``CircuitBreaker``, собирает статистику вызовов функций. Он содержит счетчики которые содержат успешные и неудачные вызовы функции. Вызовы функций должны быть обернуты методом `CircuitBreaker.call`, чтобы собирать статистику.

source: Usage example:
ru: Пример использования:

source: from aiohttp import web, ClientSession from aiomisc.service.aiohttp import AIOHTTPService import aiohttp import aiomisc async def public_gists(request): async with aiohttp.ClientSession() as session: # Using as context manager with request.app["github_cb"].context(): url = 'https://api.github.com/gists/public' async with session.get(url) as response: data = await response.text() return web.Response( text=data, headers={"Content-Type": "application/json"} ) class API(AIOHTTPService): async def create_application(self): app = web.Application() app.add_routes([web.get('/', public_gists)]) # When 30% errors in 20 seconds # Will be broken for 5 seconds app["github_cb"] = aiomisc.CircuitBreaker( error_ratio=0.2, response_time=20, exceptions=[aiohttp.ClientError], broken_time=5 ) return app async def main(): async with ClientSession() as session: async with session.get("http://localhost:8080/") as response: assert response.headers if __name__ == '__main__': with aiomisc.entrypoint(API(port=8080)) as loop: loop.run_until_complete(main())
ru: from aiohttp import web, ClientSession from aiomisc.service.aiohttp import AIOHTTPService import aiohttp import aiomisc async def public_gists(request): async with aiohttp.ClientSession() as session: # Используем как контекстный менеджер with request.app["github_cb"].context(): url = 'https://api.github.com/gists/public' async with session.get(url) as response: data = await response.text() return web.Response( text=data, headers={"Content-Type": "application/json"} ) class API(AIOHTTPService): async def create_application(self): app = web.Application() app.add_routes([web.get('/', public_gists)]) # Если ошибок 30% за 20 секунд # Сломаемся на 5 секунд app["github_cb"] = aiomisc.CircuitBreaker( error_ratio=0.2, response_time=20, exceptions=[aiohttp.ClientError], broken_time=5 ) return app async def main(): async with ClientSession() as session: async with session.get("http://localhost:8080/") as response: assert response.headers if __name__ == '__main__': with aiomisc.entrypoint(API(port=8080)) as loop: loop.run_until_complete(main())

source: The `CircuitBreaker` object might be one of three states:
ru: Объект `CircuitBreaker` может находится в одном из трех состояний:

source: **PASSING**
ru: **PASSING** - аналогия с "ток протекает" (прим. пер.)

source: **BROKEN**
ru: **BROKEN** - аналогия со "сгоревшим предохранителем" (прим. пер.)

source: **RECOVERING**
ru: **RECOVERING** - восстанавливается

source: **PASSING** means all calls will be passed as is and statistics will be gathered. The next state will be determined after collecting statistics for ``passing_time`` seconds. If an effective error ratio is greater than `error_ratio` then the next state will be set to **BROKEN**, otherwise, it will remain unchanged.
ru: **PASSING** означает, что все вызовы будут переданы как есть, но будет собираться статистика. Следующее состояние будет определено после сбора статистики за ``passing_time`` секунд. Если эффективный коэффициент ошибок больше чем `error_ratio`, тогда следующее состояние будет установлено как **BROKEN** (предохранитель перегорел, прим. пер.), в противном случае оно останется неизменным.

source: **BROKEN** means the wrapped function won't be called and ``CircuitBroken`` an exception will be raised instead. **BROKEN** state will be kept for ``broken_time`` seconds.
ru: **BROKEN** означает, что обернутая функция не будет вызываться и вместо нее будет брошено исключение ``CircuitBroken``. Состояние **BROKEN** будет сохраняться в течение ``broken_time`` секунд.

source: ``CircuitBroken`` exception is a consequence of **BROKEN** or **RECOVERY** state and never be accounted for in the statistic.
ru: Исключение ``CircuitBroken`` является следствием состояния **BROKEN** или **RECOVERY** и никогда не учитывается в статистике.

source: After that, it changes to **RECOVERING** state. While in that state, a small sample of the wrapped function calls will be executed and statistics will be gathered. If the effective error ratio after ``recovery_time`` is lower than ``error_ratio`` then the next state will be set to **PASSING**, and otherwise - to **BROKEN**.
ru: После этого предохранитель переходит в состояние **RECOVERING**. В этом состоянии фактически будет выполняться небольшая выборка обернутых вызовов функции, но будет собираться статистика. Если эффективный коэффициент ошибок после ``recovery_time`` ниже, чем ``error_ratio``, то следующее состояние будет установлено в **PASSING**, в противном случае снова **BROKEN**.

source: Argument ``exception_inspector`` is a function that is called whenever an exception from the list of monitored exceptions occurs. When ``False`` will be returned, this exception will be ignored.
ru: Аргумент ``exception_inspector`` это функция, которая вызывается всякий раз, когда происходит исключение из списка отслеживаемых исключений. Если она возвращает ``False`` - исключение будет проигнорировано.

source: cutout
ru: Декоратор ``cutout`` - "рубильник"

source: Decorator for ``CircuitBreaker`` which wrapping functions.
ru: Декоратор оборачивающий функцию таким образом, что все вызовы проходят через предохраннитель, а именно через экземпляр ``CircuitBreaker`` для этой функции.

source: from aiohttp import web, ClientSession from aiomisc.service.aiohttp import AIOHTTPService import aiohttp import aiomisc # When 20% errors in 30 seconds # Will be broken on 30 seconds @aiomisc.cutout(0.2, 30, aiohttp.ClientError) async def fetch(session, url): async with session.get(url) as response: return await response.text() async def public_gists(request): async with aiohttp.ClientSession() as session: data = await fetch( session, 'https://api.github.com/gists/public' ) return web.Response( text=data, headers={"Content-Type": "application/json"} ) class API(AIOHTTPService): async def create_application(self): app = web.Application() app.add_routes([web.get('/', public_gists)]) return app async def main(): async with ClientSession() as session: async with session.get("http://localhost:8080/") as response: assert response.headers if __name__ == '__main__': with aiomisc.entrypoint(API(port=8080)) as loop: loop.run_until_complete(main())
ru: from aiohttp import web, ClientSession from aiomisc.service.aiohttp import AIOHTTPService import aiohttp import aiomisc # Если 20% ошибок за 30 секунд # Сломаемся на 30 секунд @aiomisc.cutout(0.2, 30, aiohttp.ClientError) async def fetch(session, url): async with session.get(url) as response: return await response.text() async def public_gists(request): async with aiohttp.ClientSession() as session: data = await fetch( session, 'https://api.github.com/gists/public' ) return web.Response( text=data, headers={"Content-Type": "application/json"} ) class API(AIOHTTPService): async def create_application(self): app = web.Application() app.add_routes([web.get('/', public_gists)]) return app async def main(): async with ClientSession() as session: async with session.get("http://localhost:8080/") as response: assert response.headers if __name__ == '__main__': with aiomisc.entrypoint(API(port=8080)) as loop: loop.run_until_complete(main())
