Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/index.po
Languages: ru

source: aiomisc - miscellaneous utils for asyncio
ru: aiomisc - это библиотека с различными утилитами для asyncio

source: Latest Version
ru: Актуальная версия

source: As a programmer, you are no stranger to the challenges that come with building and maintaining software applications. One area that can be particularly difficult is designing the architecture of asynchronous I/O software.
ru: Вам, как программисту, знакомы проблемы, связанные с разработкой и обслуживанием программ. Одним из направлений, которое может быть особенно сложным, является проектирование архитектуры программы, использующей асинхронный ввод-вывод.

source: This is where ``aiomisc`` comes in. It is a Python library that provides a collection of utility functions and classes for working with asynchronous I/O in a more intuitive and efficient way. It is built on top of the ``asyncio`` library and is designed to make it easier for developers to write asynchronous code that is both reliable and scalable.
ru: Вот тут на сцену выходит ``aiomisc``. Это библиотека Python, которая предоставляет набор служебных функций и классов для работы с асинхронным IO более интуитивно понятным и эффективным способом. Она построена используя библиотеку asyncio и предназначена для облегчения написания асинхронного кода разработчиками, который является надежным и масштабируемым.

source: With ``aiomisc``, you can take advantage of powerful features like :doc:`worker pools </worker_pool>`, :doc:`connection pools </pool>`, :doc:`circuit breaker pattern </circuit_breaker>`, and retry mechanisms such as :doc:`asyncbackoff </async_backoff>` and :ref:`asyncretry <asyncretry>` to make your asyncio code more robust and easier to maintain. In this documentation, we'll take a closer look at what ``aiomisc`` has to offer and how it can help you streamline your asyncio service development.
ru: С aiomisc вы можете воспользоваться такими мощными функциями, как: :doc:`worker пул </worker_pool>`, :doc:`connection пул </pool>`, :doc:`шаблон «предохранитель» </circuit_breaker>`, и механизмы повторов такие как :doc:`asyncbackoff </async_backoff>` и :ref:`asyncretry <asyncretry>` чтобы сделать ваш асинхронный код более надежным и простым в обслуживании. В этой документации мы более подробно рассмотрим, что может предложить ``aiomisc`` и как он может помочь вам упростить разработку сервисов с asyncio.

source: Why use aiomisc?
ru: Зачем использовать aiomisc?

source: **Problem:** Production asyncio applications require significant boilerplate for logging, graceful shutdown, thread pools, and error handling.
ru: **Проблема:** Продакшн-приложения на asyncio требуют значительного шаблонного кода для логирования, корректного завершения, пулов потоков и обработки ошибок.

source: **Solution:** aiomisc handles infrastructure so you can focus on business logic.
ru: **Решение:** aiomisc берёт на себя инфраструктуру, чтобы вы могли сосредоточиться на бизнес-логике.

source: Plain asyncio
ru: Чистый asyncio

source: With aiomisc
ru: С aiomisc

source: Manual signal handling
ru: Ручная обработка сигналов

source: Built into entrypoint
ru: Встроено в entrypoint

source: Manual logging setup
ru: Ручная настройка логирования

source: Single parameter
ru: Один параметр

source: Manual thread pool
ru: Ручной пул потоков

source: Automatic + @threaded
ru: Автоматически + @threaded

source: Try/finally cleanup
ru: Очистка в try/finally

source: Service stop() method
ru: Метод stop() сервиса

source: Installation
ru: Установка

source: Installation is possible in standard ways, such as PyPI or installation from a git repository directly.
ru: Возможна установка стандартными способами, такими как PyPI или установка из репозитория git напрямую.

source: Installing from PyPI_:
ru: Установка с PyPI_:

source: Installing from github.com:
ru: Установка из репозитория на github.com:

source: The package contains several extras and you can install additional dependencies if you specify them in this way.
ru: Пакет содержит несколько дополнений, и вы можете установить дополнительные зависимости, если вы укажете их таким образом.

source: With uvloop_:
ru: Вместе с uvloop_

source: With aiohttp_:
ru: Вместе с aiohttp_:

source: Complete table of extras below:
ru: Полная таблица дополнений приведена ниже:

source: example
ru: пример

source: description
ru: описание

source: For running aiohttp_ applications.
ru: Для запуска приложений написанных с aiohttp_.

source: For running ASGI_ applications
ru: Для запуска ASGI_ приложений

source: Sending metrics to carbon_ (part of graphite_)
ru: Чтобы посылать метрики в carbon_ (часть graphite_)

source: use croniter_ for scheduling tasks
ru: планирование задач с библиотекой croniter_

source: Sending exceptions to sentry_ using raven_
ru: Чтобы посылать исключения в sentry_ используя raven_

source: Use rich_ for logging
ru: Использовать rich_ для логирования

source: For running ASGI_ application using uvicorn_
ru: Для запуска ASGI_ приложений через uvicorn_

source: use uvloop_ as a default event loop
ru: используйте uvloop_ как основной event-loop

source: You can combine extras values by separating them with commas, for example:
ru: Вы можете комбинировать эти значения разделяя их запятыми, пример:

source: Quick Start
ru: Быстрый старт

source: This section will cover how this library creates and uses the event loop and creates services. For more details see :doc:`/tutorial` section, and you can always refer to the :doc:`/modules` and :doc:`/api/index` sections for help.
ru: В этом разделе будет рассказано, как эта библиотека создает и использует цикл обработки событий и создает службы. Конечно, обо всем тут не напишешь, но о многом можно прочитать в разделе :doc:`/tutorial`, и всегда можно обратиться к разделу :doc:`/modules` и разделу :doc:`/api/index` для справки.

source: Event-loop and entrypoint
ru: Eventloop и entrypoint

source: Let's look at this simple example first:
ru: Сначала рассмотрим этот простой пример:

source: This code declares an asynchronous ``main()`` function that exits after 3 seconds. It would seem nothing interesting, but the whole point is in the ``entrypoint``.
ru: Этот код объявляет асинхронную функцию ``main()``, которая завершается через 3 секунды. Казалось бы, ничего интересного, но всё дело в ``entrypoint``.

source: At first glance the ``entrypoint`` does not do much, it just creates an event-loop and transfers control to the user. However, under the hood, the logger is configured in a separate thread, a pool of threads is created, services are started, but more on that later as there are no services in this example.
ru: На первый взгляд ``entrypoint`` делает не так уж и много — он создаёт event-loop и передаёт управление пользователю. Однако под капотом настраивается логирование в отдельном потоке, создаётся пул потоков, запускаются сервисы, но об этом позже, поскольку в данном примере сервисов нет.

source: Alternatively, you can use the standard ``asyncio.Runner``:
ru: В качестве альтернативы можно использовать стандартный ``asyncio.Runner``:

source: Services
ru: Сервисы

source: The main thing that an ``entrypoint`` does is start and gracefully stop services.
ru: Главное, что делает точка входа, — это запускает и корректно останавливает «Сервисы».

source: The service concept within this library means a class derived from the ``aiomisc.Service`` class and implementing the ``async def start(self) -> None:`` method and optionally the ``async def stop(self, exc: Optional[ Exception]) -> None`` method.
ru: Концепция «Сервис» в этой библиотеке означает класс, унаследованный от класса ``aiomisc.Service`` и реализующий метод ``async def start(self) -> None:``, а также, опционально, метод ``async def stop(self, exc: Optional[ Exception]) -> None``.

source: The concept of stopping a service doesn't necessarily mean pressing ``Ctrl+C`` by the user, it's actually just exiting the ``entrypoint`` context manager.
ru: Концепция остановки сервиса не обязательно означает нажатие пользователем клавиш ``Ctrl+C`` — на самом деле это просто выход из контекстного менеджера ``entrypoint``.

source: The example below shows what your service might look like:
ru: Пример ниже иллюстрирует, как может выглядеть ваш сервис:

source: The entry point can start as many instances of the service as it likes, and all of them will start concurrently.
ru: Точка входа может запускать любое количество экземпляров службы, и все они будут запускаться конкурентно.

source: There is also a way if the ``start`` method is a payload for a service, and then there is no need to implement the stop method, since the running task with the ``start`` function will be canceled at the stop stage. But in this case, you will have to notify the ``entrypoint`` that the initialization of the service instance is complete and it can continue.
ru: Также есть способ, если метод ``start`` является полезной нагрузкой для сервиса, и тогда нет необходимости реализовывать метод ``stop``, так как задача с функцией ``start`` будет отменена на этапе выхода из entrypoint. Но в этом случае вам придется уведомить ``entrypoint`` о том, что инициализация экземпляра службы завершена и ее можно продолжить.

source: Like this:
ru: Примерно так:

source: The ``entrypoint`` passes control to the body of the context manager only after all service instances have started. As mentioned above, a start is considered to be the completion of the ``start`` method or the setting of an start event with ``self.start_event.set()``.
ru: ``entrypoint`` передает управление телу контекстного менеджера только после того, как все экземпляры службы запущены. Как упоминалось выше, стартом считается завершение метода ``start`` или установка стартового события с помощью ``self.start_event.set()``.

source: The whole power of this library is in the set of already implemented or abstract services. Such as: :ref:`AIOHTTPService <aiohttp-service>`, :ref:`ASGIService <asgi-service>`, :ref:`TCPServer <tcp-server>`, :ref:`UDPServer <udp-server>`, :ref:`TCPClient <tcp-client>`, :ref:`PeriodicService <periodic-service>`, :ref:`CronService <cron-service>` and so on.
ru: Вся мощь этой библиотеки это набор уже реализованных или абстрактных сервисов таких как: :ref:`AIOHTTPService <aiohttp-service>`, :ref:`ASGIService <asgi-service>`, :ref:`TCPServer <tcp-server>`, :ref:`UDPServer <udp-server>`, :ref:`TCPClient <tcp-client>`, :ref:`PeriodicService <periodic-service>`, :ref:`CronService <cron-service>` и так далее.

source: Unfortunately in this section it is not possible to pay more attention to this, please pay attention to the :doc:`/tutorial` section section, there are more examples and explanations, and of course you can always find an answer in the :doc:`/api/index` or in the source code. The authors have tried to make the source code as clear and simple as possible, so feel free to explore it.
ru: К сожалению, в данном разделе нет возможности уделить этому больше внимания. Обратите внимание на раздел :doc:`/tutorial`, там больше примеров и пояснений. Ну и, конечно, вы всегда можете найти ответ в :doc:`/api/index` или в исходном коде. Авторы постарались сделать исходный код максимально понятным и простым, поэтому не стесняйтесь исследовать его.

source: Versioning
ru: Версионирование

source: This software follows `Semantic Versioning`_
ru: Это программное обеспечение следует методологиии `Семантического Версионирования`_

source: Summary: it's given a version number MAJOR.MINOR.PATCH, increment the:
ru: Кратко: учитывая номер версии МАЖОРНАЯ.МИНОРНАЯ.ПАТЧ, следует увеличивать:

source: MAJOR version when you make incompatible API changes
ru: МАЖОРНУЮ версию, когда сделаны обратно несовместимые изменения API.

source: MINOR version when you add functionality in a backwards compatible manner
ru: МИНОРНУЮ версию, когда вы добавляете новую функциональность, не нарушая обратной совместимости.

source: PATCH version when you make backwards compatible bug fixes
ru: ПАТЧ-версию, когда вы делаете обратно совместимые исправления.

source: Additional labels for pre-release and build metadata are available as extensions to the MAJOR.MINOR.PATCH format.
ru: Дополнительные обозначения для предрелизных и билд-метаданных возможны как дополнения к МАЖОРНАЯ.МИНОРНАЯ.ПАТЧ формату.

source: In this case, the package version is assigned automatically with poem-plugins_, it using on the tag in the repository as a major and minor and the counter, which takes the number of commits between tag to the head of branch.
ru: В этом проекте версия пакета назначается автоматически с помощью poem-plugins_, он использует тег в репозитории как МАЖОР и МИНОР, а также счетчик, который берет количество коммитов между тегом и головой ветки.

source: How to develop?
ru: Как разрабатывать этот проект?

source: This project, like most open source projects, is developed by enthusiasts, you can join the development, submit issues, or send your merge requests.
ru: Этот проект, как и многие другие open source проекты, разрабатывается энтузиастами, и вы можете присоединиться к разработке, создавайте issues в github или присылайте свои правки как merge request.

source: In order to start developing in this repository, you need to do the following things.
ru: Чтобы начать разработку в этом репозитории, вам необходимо сделать следующее:

source: Should be installed:
ru: Должно быть установлено

source: Python 3.7+ as ``python3``
ru: Python 3.7+ как ``python3``

source: Installed Poetry_ as ``poetry``
ru: Установлен Poetry_ как ``poetry``

source: For setting up developer environment just execute:
ru: Для настройки окружения разработчика выполните:
