Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/io.po
Languages: ru

source: asynchronous file operations
ru: асинхронные операции с файлами

source: Asynchronous files operations including support for data compression on the fly. Based on the thread pool under the hood.
ru: Асинхронные файловые операции, включая поточную компрессию данных. Работают в пуле потоков "под капотом".

source: import aiomisc import tempfile from pathlib import Path async def file_write(): with tempfile.TemporaryDirectory() as tmp: fname = Path(tmp) / 'test.txt' # Some tools, such as mypy, will not be able to infer the type # from the `async_open` function based on the `b` character passed # to the mode. # We'll have to tell the type here explicitly. afp: aiomisc.io.AsyncTextIO async with aiomisc.io.async_open(fname, 'w+') as afp: await afp.write("Hello") await afp.write(" ") await afp.write("world") await afp.seek(0) print(await afp.read()) with aiomisc.entrypoint() as loop: loop.run_until_complete(file_write())
ru: import aiomisc import tempfile from pathlib import Path async def file_write(): with tempfile.TemporaryDirectory() as tmp: fname = Path(tmp) / 'test.txt' # Некоторые инструменты, такие как mypy, не смогут вывести тип # из функции async_open основываясь на переданном символе `b` в режим. # Придется тут подсказать тип явно. afp: aiomisc.io.AsyncTextIO async with aiomisc.io.async_open(fname, 'w+') as afp: await afp.write("Hello") await afp.write(" ") await afp.write("world") await afp.seek(0) print(await afp.read()) with aiomisc.entrypoint() as loop: loop.run_until_complete(file_write())

source: This is the way to working with files based on threads. It's very similar to `aiofiles`_ project and same limitations.
ru: Этот способ работы с файлами основан на потоках. Это очень похоже на то как сделано в библиотеке `aiofiles`_ с теми-же ограничениями.

source: Of course, you can use `aiofile`_ project for this. But it's not a silver bullet and has OS API-related limitations.
ru: Разумеется вы можете использовать библиотеку `aiofile`_ для этого. Но это не панацея, так как имеет ограничения связанные с API операционной системы.

source: In general, for light loads, I would advise you to adhere to the following rules:
ru: В основном, для небольших нагрузок приложений, я рекомендую придерживаться следующих правил:

source: If reading and writing small or big chunks from files with random access is the main task in your project, use `aiofile`_.
ru: Если чтение и запись маленьких или больших кусочков в файлы со случайным доступом основная задача приложения - стоит использовать `aiofile`_.

source: Otherwise use this module or `aiofiles`_
ru: Иначе можно взять этот модуль или `aiofiles`_

source: If the main task is to read large chunks of files for processing, both of the above methods are not optimal cause you will switch context each IO operation, it's often suboptimal for file cache and you will be lost execution time for context switches. In case for thread-based IO executor implementation thread context switches cost might be more expensive than IO operation time in summary.
ru: Если основная задача читать большие куски файлов для дальнейшей их обработки оба вышеописанных метода будут не оптимальны, так как переключения контекста каждую IO операцию - это скорее всего не будет оптимально для файлового кеша и можно потерять бóльшую часть времени исполнения на переключение контекста исполнения. В случае имплементации асинхронного IO на основе потоков цена переключения контектса между потоками может оказаться выше чем суммарно время исполнения всех IO операций.

source: Just try pack all blocking staff in separate functions and call it in a thread pool, see the example bellow:
ru: Просто попробуйте завернуть все блокирующие вызовы в отдельные функции и вызывайте их используя пул потоков (см. пример ниже):

source: In the fly compression
ru: Поточное сжатие

source: To enable compression, you need to pass the `compression` argument to the `async_open` function.
ru: Чтобы включить поточное сжатие, нужно передать аргумент `compression` в функцию `async_open`.

source: Supported compressors:
ru: Поддерживаемые алгоритмы сжатия:

source: An example of usage:
ru: Пример использования
