Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/logging.po
Languages: ru

source: Logging configuration
ru: Конфигурация логирования

source: Default logging configuration might be configured by setting environment variables:
ru: Конфигурация логирования по умолчанию может быть осуществлена через переменные окружения:

source: `AIOMISC_LOG_LEVEL` - default logging level
ru: `AIOMISC_LOG_LEVEL` - уровень логирования по умолчанию

source: `AIOMISC_LOG_FORMAT` - default log format
ru: `AIOMISC_LOG_FORMAT` - формат логирования по умолчанию

source: `AIOMISC_LOG_CONFIG` - should logging be configured
ru: `AIOMISC_LOG_CONFIG` - следует ли настраивать логирование

source: `AIOMISC_LOG_FLUSH` - interval between logs flushing from buffer
ru: `AIOMISC_LOG_FLUSH` - интервал сброса буфера логов logs

source: `AIOMISC_LOG_BUFFER` - maximum log buffer size
ru: `AIOMISC_LOG_BUFFER` - максимальный размер буфера логов

source: Setting up colorized logs:
ru: Настройка цветных логов:

source: Setting up json logs:
ru: Настройка json логов:

source: `JournalD`_ daemon for collecting logs. It's a part of the systemd. `aiomisc.basic_config` has support for using `JournalD`_ for store logs.
ru: `JournalD`_ демон для сбора логов он является частью systemd. `aiomisc.basic_config` может писать логи в `JournalD`_.

source: This handler is the default when the program starting as a systemd service.
ru: Этот обработчик выбирается по умолчанию если программа запускается как systemd сервис.

source: `aiomisc.log.LogFormat.default()` will returns `journald` in this case.
ru: `aiomisc.log.LogFormat.default()` вернет `journald` в этом случае.

source: `Rich`_ is a Python library for rich text and beautiful formatting in the terminal.
ru: `Rich`_ это Python библиотека которая делает форматирование в терминал прекрасным.

source: `aiomisc.basic_config` has support for using `Rich`_ as a logging handler. But it isn't dependency and you have to install `Rich`_ manually.
ru: `aiomisc.basic_config` может использовать `Rich`_ для логирования. Но это не обязательно, поэтому вам придется установить `Rich`_ самостоятельно.

source: This handler is the default when the `Rich` has been installed.
ru: Этот обработчик будет обработчиком по умолчанию если `Rich` установлен.

source: import logging from aiomisc.log import basic_config # Configure rich log handler basic_config(level=logging.INFO, buffered=False, log_format='rich') logging.info("Rich logger") # Configure rich log handler with rich tracebacks display basic_config(level=logging.INFO, buffered=False, log_format='rich_tb') try: 1 / 0 except: logging.exception("Rich traceback logger")
ru: import logging from aiomisc.log import basic_config # Конфигурируем rich обработчик для журналов basic_config(level=logging.INFO, buffered=False, log_format='rich') logging.info("Rich logger") # Конфигурируем rich обработчик для журналов но с показом трейсбеков basic_config(level=logging.INFO, buffered=False, log_format='rich_tb') try: 1 / 0 except: logging.exception("Rich traceback logger")

source: Disable to configure logging handler. Useful when you want to configure your own logging handlers using `handlers=` argument.
ru: Отключает конфигурацию логов. Полезно когда вы сами хотите сконфигурировать свои собственные logging хендлеры передав их в аргумент `handlers=`.

source: Buffered log handler
ru: Буфферизирующий лог-хендлер

source: Parameter `buffered=True` enables a memory buffer that flushes logs in a thread. In case the `handlers=` each will be buffered.
ru: Параметр `buffered=True` включает буферизацию логов в памяти, отдельный поток переодически сбрасывает логи в файловый дескриптор. В случае `handlers=` все станут буферизированными.

source: import asyncio import logging from aiomisc.log import basic_config from aiomisc.periodic import PeriodicCallback from aiomisc.utils import new_event_loop # Configure logging globally basic_config(level=logging.INFO, buffered=False, log_format='json') async def write_log(loop): logging.info("Hello %f", loop.time()) if __name__ == '__main__': loop = new_event_loop() # Configure basic_config( level=logging.INFO, buffered=True, log_format='color', flush_interval=0.5 ) periodic = PeriodicCallback(write_log, loop) periodic.start(0.3) # Wait for flush just for example loop.run_until_complete(asyncio.sleep(1))
ru: import asyncio import logging from aiomisc.log import basic_config from aiomisc.periodic import PeriodicCallback from aiomisc.utils import new_event_loop # Глобально конфигурируем журналы basic_config(level=logging.INFO, buffered=False, log_format='json') async def write_log(loop): logging.info("Hello %f", loop.time()) if __name__ == '__main__': loop = new_event_loop() # Конфигурируем basic_config( level=logging.INFO, buffered=True, log_format='color', flush_interval=0.5 ) periodic = PeriodicCallback(write_log, loop) periodic.start(0.3) # Ждем пока журналы не попадут в журнал loop.run_until_complete(asyncio.sleep(1))

source: ``entrypoint`` accepts ``log_format`` parameter for configure it.
ru: ``entrypoint`` принимает аргумент ``log_format`` через который можно это настроить.

source: List of all supported log formats is available from ``aiomisc.log.LogFormat.choices()``
ru: Список всех поддерживаемых форматов журналов доступен через ``aiomisc.log.LogFormat.choices()``
