Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/plugins.po
Languages: ru

source: aiomisc can be extended with plugins as separate packages. Plugins can enhance aiomisc by mean of signals_.
ru: aiomisc можно расширить с помощью плагинов в виде отдельных python пакетов. Плагины взаимодействуют с aiomisc с помощью signals_.

source: To make your plugin discoverable by aiomisc you should add ``aiomisc.plugins`` entry to entry to ``entry_points`` argument of ``setup`` call in ``setup.py`` of a plugin.
ru: Чтобы сделать ваш плагин доступным для обнаружения с помощью aiomisc, вы должны добавить запись ``aiomisc.plugins`` к записи аргумента ``entry_points`` вызова ``setup`` в ``setup.py`` вашего python пакета.

source: If you use `pyproject.toml` you might define it like this:
ru: В случае `pyproject.toml` можно это описать вот-так:

source: Modules provided in ``entry_points`` should have ``setup`` function. These functions would be called by aiomisc and must contain signals connecting.
ru: Модули, представленные в `entry_points``, должны иметь функцию ``setup``. Эти функции будут вызываться aiomisc и должны поддерживать сигналы.

source: If the services are started dynamically, the attached functions will run every time the services are started and stopped, however, only services that are currently starting or stopping will be in the ``services`` parameter.
ru: Если сервисы запускаются динамически, присоединенные функции будут выполняться каждый раз при запуске и остановке служб, однако только те службы, которые в данный момент запускаются или останавливаются, будут в параметре services.

source: # Content of: ``aiomisc_myplugin/plugin.py`` from typing import Tuple from threading import Event import aiomisc event = Event() # Will be shown in ``python -m aiomisc.plugins`` __doc__ = "Example plugin" async def hello( *, entrypoint: aiomisc.Entrypoint, services: Tuple[aiomisc.Service, ...] ) -> None: print('Hello from aiomisc plugin') event.set() def setup() -> None: """ This code will be called by loading plugins declared in ``pyproject.toml`` or ``setup.py``. """ aiomisc.Entrypoint.PRE_START.connect(hello) # Content of: ``my_plugin_example.py`` # ====================================================================== # The code below is not related to the plugin, but serves to demonstrate # how it works. # ====================================================================== def main(): """ some function in user code """ # This function will be called by aiomisc.plugin module # in this example it's just for demonstration. setup() assert not event.is_set() with aiomisc.entrypoint() as loop: pass assert event.is_set() main() # remove the plugin on when unneeded aiomisc.entrypoint.PRE_START.disconnect(hello)
ru: # Содержимое: ``aiomisc_myplugin/plugin.py`` from typing import Tuple from threading import Event import aiomisc event = Event() # Будет показано в ``python -m aiomisc.plugins`` __doc__ = "Пример плагина" async def hello( *, entrypoint: aiomisc.Entrypoint, services: Tuple[aiomisc.Service, ...] ) -> None: print('Hello from aiomisc plugin') event.set() def setup() -> None: """ Этот код будет вызван при загрузке плагинов, объявленных в ``pyproject.toml`` или ``setup.py``. """ aiomisc.Entrypoint.PRE_START.connect(hello) # Содержимое: ``my_plugin_example.py`` # ====================================================================== # Код ниже не относится к плагину, а служит для демонстрации # его работы. # ====================================================================== def main(): """ некоторая функция в пользовательском коде """ # Эта функция будет вызвана модулем aiomisc.plugin # в этом примере только для демонстрации. setup() assert not event.is_set() with aiomisc.entrypoint() as loop: pass assert event.is_set() main() # удаление плагина, когда он больше не нужен aiomisc.entrypoint.PRE_START.disconnect(hello)

source: The following signals are available in total:
ru: Список доступных сигналов такой:

source: ``Entrypoint.PRE_START`` - Will be called before `starting` services.
ru: ``Entrypoint.PRE_START`` - Запускается перед `стартом` сервисов.

source: ``Entrypoint.PRE_STOP`` - Will be called before `stopping` services.
ru: ``Entrypoint.PRE_STOP`` - Запускается перед `остановкой` сервисов.

source: ``Entrypoint.POST_START`` - Will be called after services has been `started`.
ru: ``Entrypoint.POST_START`` - Запускается после `старта` сервисов.

source: ``Entrypoint.POST_STOP`` - Will be called after services has been `stopped`.
ru: ``Entrypoint.POST_STOP`` - Запускается после `остановки` сервисов

source: List available plugins
ru: Список доступный плагинов

source: To see a list of all available plugins, you can call from the command line ``python -m aiomisc.plugins``:
ru: Чтобы просмотреть список всех доступных плагинов, вы можете вызвать из командной строки ``python -m aiomisc.plugins``:

source: You can also change the behavior and output of the list of modules. To do this, there are the following flags:
ru: Вы также можете изменить поведение и вывод списка модулей. Для этого существуют следующие флаги:

source: Here are some run examples.
ru: Вот несколько примеров запуска.

source: This prints human-readable list of plugins and its descriptions.
ru: Этот пример, печатает удобочитаемый список плагинов и их описания.

source: This useful for ``grep`` or other pipelining tools.
ru: Это полезно для ``grep`` или других утилит.

source: The default prints both, the human-readable log to stderr and the list of plugins to stdout, so you can use this without options in a pipeline, and read the list to stderr.
ru: По умолчанию печатается человекочитаемый лог в stderr, и список плагинов в stdout, поэтому можно использовать это без параметров в конвейере, и прочитать список в stderr.
