Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/pytest.po
Languages: ru

source: Pytest plugin
ru: Плагин для Pytest

source: This package contains a plugin for pytest.
ru: Этот пакет содержит plugin для pytest.

source: Basic usage
ru: Простой пример

source: Simple usage example:
ru: Простой пример использования:

source: asynchronous fixture example:
ru: пример асинхронной фикстуры:

source: In case you have to save an instance of an async fixture between tests, the wrong solution is just changing the fixture scope. But why it wouldn't work? That's because, in the base scenario, the ``loop`` fixture creates a new event loop instance per test which will be closed after test teardown. When you have to use an async fixture any caller of ``asyncio.get_event_loop()`` will get the current event loop instance which will be closed and the next test will run in another event loop. So the solution is to redefine the ``loop`` fixture with the required scope and custom fixture with the required scope.
ru: В случае, если вам необходимо сохранить экземпляр асинхронной фиксуры между тестами, неправильным решением будет просто изменить scope фикстуры.Но почему это не сработает? Это связано с тем, что в базовом сценарии фикстура ``loop`` создает новый экземпляр event-loop для каждого теста, и он будет закрыт по завершении теста. Когда нужно использовать асинхронную фикстуру, любой вызов ``asyncio.get_event_loop()`` вернет текущий экземпляр event-loop, который будет закрыт, и следующий тест будет выполняться в другом экземпляре event-loop.Таким образом, решение заключается в переопределении фикстуры ``loop`` с требуемым scope и пользовательской фиктуры.

source: pytest markers
ru: маркеры pytest

source: Package contains some useful markers for pytest:
ru: Пакет содержит несколько полезных маркеров для pytest:

source: ``catch_loop_exceptions`` - uncaught event loop exceptions will failling test.
ru: ``catch_loop_exceptions`` - непойманные исклбчения в event loop сломают тест.

source: ``forbid_get_event_loop`` - forbids call ``asyncio.get_event_loop`` during test case.
ru: ``forbid_get_event_loop`` - запрещает вызов ``asyncio.get_event_loop`` при прогоне теста.

source: import pytest # Test will be failed @pytest.mark.forbid_get_event_loop async def test_with_get_loop(): def switch_context(): loop = get_event_loop() future = loop.create_future() loop.call_soon(future.set_result, True) return future with pytest.raises(Failed): await switch_context() # Test will be failed @pytest.mark.catch_loop_exceptions async def test_with_errors(loop): async def fail(): # switch context await asyncio.sleep(0) raise Exception() loop.create_task(fail()) await asyncio.sleep(0.1) return
ru: import pytest # Тест упадет @pytest.mark.forbid_get_event_loop async def test_with_get_loop(): def switch_context(): loop = get_event_loop() future = loop.create_future() loop.call_soon(future.set_result, True) return future with pytest.raises(Failed): await switch_context() # Тест упадет @pytest.mark.catch_loop_exceptions async def test_with_errors(loop): async def fail(): # переключаем контекст await asyncio.sleep(0) raise Exception() loop.create_task(fail()) await asyncio.sleep(0.1) return

source: Passing default context
ru: Передача контекста по умолчанию

source: Testing services
ru: Тестирование сервисов

source: Redefine ``services`` fixture in your test module:
ru: Переопределите фикстуру ``services`` в вашем тестовом модуле:

source: Event loop policy overriding
ru: Переопределение политики создания цикла событий

source: Thread pool overriding
ru: Переопределение пула потоков

source: entrypoint arguments
ru: агрументы entrypoint

source: aiohttp test client
ru: тестовый класс для aiohttp

source: Simple TCP proxy for emulate network problems. Available as fixture `tcp_proxy`
ru: Простой TCP proxy для эмуляции сетевых проблем. Доступен как фикстура `tcp_proxy`

source: Examples:
ru: Примеры:

source: import asyncio import time import pytest import aiomisc class EchoServer(aiomisc.service.TCPServer): async def handle_client( self, reader: asyncio.StreamReader, writer: asyncio.StreamWriter ): chunk = await reader.read(65534) while chunk: writer.write(chunk) chunk = await reader.read(65534) writer.close() await writer.wait_closed() @pytest.fixture() def server_port(aiomisc_unused_port_factory) -> int: return aiomisc_unused_port_factory() @pytest.fixture() def services(server_port, localhost): return [EchoServer(port=server_port, address=localhost)] @pytest.fixture() async def proxy(tcp_proxy, localhost, server_port): async with tcp_proxy(localhost, server_port) as proxy: yield proxy async def test_proxy_client_close(proxy): reader, writer = await proxy.create_client() payload = b"Hello world" writer.write(payload) response = await asyncio.wait_for(reader.read(1024), timeout=1) assert response == payload assert not reader.at_eof() await proxy.disconnect_all() assert await asyncio.wait_for(reader.read(), timeout=1) == b"" assert reader.at_eof() async def test_proxy_client_slow(proxy): read_delay = 0.1 write_delay = 0.2 # Emulation of asymmetric and slow ISP with proxy.slowdown(read_delay, write_delay): reader, writer = await proxy.create_client() payload = b"Hello world" delta = -time.monotonic() writer.write(payload) await asyncio.wait_for(reader.read(1024), timeout=2) delta += time.monotonic() assert delta >= read_delay + write_delay async def test_proxy_client_with_processor(proxy): processed_request = b"Never say hello" # Patching protocol functions proxy.set_content_processors( # Process data from client to server lambda _: processed_request, # Process data from server to client lambda chunk: chunk[::-1], ) reader, writer = await proxy.create_client() writer.write(b'nevermind') response = await reader.read(16) assert response == processed_request[::-1]
ru: import asyncio import time import pytest import aiomisc class EchoServer(aiomisc.service.TCPServer): async def handle_client( self, reader: asyncio.StreamReader, writer: asyncio.StreamWriter ): chunk = await reader.read(65534) while chunk: writer.write(chunk) chunk = await reader.read(65534) writer.close() await writer.wait_closed() @pytest.fixture() def server_port(aiomisc_unused_port_factory) -> int: return aiomisc_unused_port_factory() @pytest.fixture() def services(server_port, localhost): return [EchoServer(port=server_port, address=localhost)] @pytest.fixture() async def proxy(tcp_proxy, localhost, server_port): async with tcp_proxy(localhost, server_port) as proxy: yield proxy async def test_proxy_client_close(proxy): reader, writer = await proxy.create_client() payload = b"Hello world" writer.write(payload) response = await asyncio.wait_for(reader.read(1024), timeout=1) assert response == payload assert not reader.at_eof() await proxy.disconnect_all() assert await asyncio.wait_for(reader.read(), timeout=1) == b"" assert reader.at_eof() async def test_proxy_client_slow(proxy): read_delay = 0.1 write_delay = 0.2 # Эмулируем работу ассиметричного и медленного интернет провайдера with proxy.slowdown(read_delay, write_delay): reader, writer = await proxy.create_client() payload = b"Hello world" delta = -time.monotonic() writer.write(payload) await asyncio.wait_for(reader.read(1024), timeout=2) delta += time.monotonic() assert delta >= read_delay + write_delay async def test_proxy_client_with_processor(proxy): processed_request = b"Never say hello" # Патчим функции протокола proxy.set_content_processors( # Тут обработаем данные от клиента к серверу lambda _: processed_request, # Тут обработаем данные от сервера к клиенту lambda chunk: chunk[::-1], ) reader, writer = await proxy.create_client() writer.write(b'nevermind') response = await reader.read(16) assert response == processed_request[::-1]
