Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/services.po
Languages: ru

source: import asyncio import logging import sys from aiomisc import entrypoint from aiomisc.version import __version__ from aiomisc.service.raven import RavenSender async def main(): while True: await asyncio.sleep(1) try: 1 / 0 except ZeroDivisionError: logging.exception("Exception") raven_sender = RavenSender( sentry_dsn=( "https://583ca3b555054f80873e751e8139e22a@o429974.ingest.sentry.io/" "5530251" ), client_options=dict( # Got environment variable SENTRY_NAME by default name="", # Got environment variable SENTRY_ENVIRONMENT by default environment="full_example", # Got environment variable SENTRY_RELEASE by default release=__version__, # Default options values include_paths=set(), exclude_paths=set(), auto_log_stacks=True, capture_locals=True, string_max_length=400, list_max_length=50, site=None, include_versions=True, processors=( 'raven.processors.SanitizePasswordsProcessor', ), sanitize_keys=None, context={'sys.argv': getattr(sys, 'argv', [])[:]}, tags={}, sample_rate=1, ignore_exceptions=(), ) ) with entrypoint(raven_sender) as loop: loop.run_until_complete(main())
ru: import asyncio import logging import sys from aiomisc import entrypoint from aiomisc.version import __version__ from aiomisc.service.raven import RavenSender async def main(): while True: await asyncio.sleep(1) try: 1 / 0 except ZeroDivisionError: logging.exception("Exception") raven_sender = RavenSender( sentry_dsn=( "https://583ca3b555054f80873e751e8139e22a@o429974.ingest.sentry.io/" "5530251" ), client_options=dict( # По умолчанию возьмет значение переменной окружения SENTRY_NAME name="", # По умолчанию возьмет значение переменной окружения SENTRY_ENVIRONMENT environment="full_example", # По умолчанию возьмет значение переменной окружения SENTRY_RELEASE release=__version__, # Умолчания для остальных аргументов include_paths=set(), exclude_paths=set(), auto_log_stacks=True, capture_locals=True, string_max_length=400, list_max_length=50, site=None, include_versions=True, processors=( 'raven.processors.SanitizePasswordsProcessor', ), sanitize_keys=None, context={'sys.argv': getattr(sys, 'argv', [])[:]}, tags={}, sample_rate=1, ignore_exceptions=(), ) ) with entrypoint(raven_sender) as loop: loop.run_until_complete(main())

source: You will find the full specification of options in the `Raven documentation`_.
ru: Вы можете найти полное описание параметров в `документации Raven`_.

source: Ready to use service just adding to your entrypoint and notifying SystemD service watchdog timer.
ru: Готовый к использованию сервис, просто добавьте его в entrypoint и он будет отправлять уведомления сторожевому таймеру SystemD.

source: This can be safely added at any time, since if the service does not detect systemd-related environment variables, then its initialization is skipped.
ru: Вы можете безопасно добавлять это в любом случае, так как если сервис не найдет переменных окружения, которые устанавливает systemd, Сервис просто не запустится, однако выполнение приложения продолжится.

source: Example of python file:
ru: Пример python файла:

source: Example of systemd service file:
ru: Пример systemd сервис-файла:

source: [Service] # Activating the notification mechanism Type=notify # Command which should be started ExecStart=/home/mosquito/.venv/aiomisc/bin/python /home/mosquito/scratch.py # The time for which the program must send a watchdog notification WatchdogSec=5 # Kill the process if it has stopped responding to the watchdog timer WatchdogSignal=SIGKILL # The service should be restarted on failure Restart=on-failure # Try to kill the process instead of cgroup KillMode=process # Trying to stop service properly KillSignal=SIGINT # Trying to restart service properly RestartKillSignal=SIGINT # Send SIGKILL when timeouts are exceeded FinalKillSignal=SIGKILL SendSIGKILL=yes
ru: [Service] # Активизируем механизм уведомлений Type=notify # Команда которую следует запускать ExecStart=/home/mosquito/.venv/aiomisc/bin/python /home/mosquito/scratch.py # Время через которое программа должны посылать нотификации сторожевого таймера WatchdogSec=5 # Процесс будет убит если он перестал отвечать сторожевому таймеру WatchdogSignal=SIGKILL # Сервис будет перезапущен в случае ошибки Restart=on-failure # Пробуем убить сам процесс вместо всей cgroup KillMode=process # Пробуем остановить сервис "помягче" KillSignal=SIGINT # Пробуем остановить сервис "помягче" при перезапуске RestartKillSignal=SIGINT # Слать SIGKILL если произошел таймаут остановки FinalKillSignal=SIGKILL SendSIGKILL=yes

source: ``ProcessService``
ru: Класс ``ProcessService``

source: A base class for launching a function by a separate system process, and by termination when the parent process is stopped.
ru: Базовый класс для запуска функции отдельным системным процессом и завершения при остановке родительского процесса.

source: from typing import Dict, Any import aiomisc.service # Fictional miner implementation from .my_miner import Miner class MiningService(aiomisc.service.ProcessService): bitcoin: bool = False monero: bool = False dogiecoin: bool = False def in_process(self) -> Any: if self.bitcoin: miner = Miner(kind="bitcoin") elif self.monero: miner = Miner(kind="monero") elif self.dogiecoin: miner = Miner(kind="dogiecoin") else: # Nothing to do return miner.do_mining() services = [ MiningService(bitcoin=True), MiningService(monero=True), MiningService(dogiecoin=True), ] if __name__ == '__main__': with aiomisc.entrypoint(*services) as loop: loop.run_forever()
ru: from typing import Dict, Any import aiomisc.service # Реализация вымышленного майнера from .my_miner import Miner class MiningService(aiomisc.service.ProcessService): bitcoin: bool = False monero: bool = False dogiecoin: bool = False def in_process(self) -> Any: if self.bitcoin: miner = Miner(kind="bitcoin") elif self.monero: miner = Miner(kind="monero") elif self.dogiecoin: miner = Miner(kind="dogiecoin") else: # Ничего делать не нужно return miner.do_mining() services = [ MiningService(bitcoin=True), MiningService(monero=True), MiningService(dogiecoin=True), ] if __name__ == '__main__': with aiomisc.entrypoint(*services) as loop: loop.run_forever()

source: ``RespawningProcessService``
ru: Класс ``RespawningProcessService``

source: A base class for launching a function by a separate system process, and by termination when the parent process is stopped, It's pretty like `ProcessService` but have one difference when the process unexpectedly exited this will be respawned.
ru: Базовый класс для запуска функции отдельным системным процессом и завершения при остановке родительского процесса. Это очень похоже на `ProcessService` с одним отличием - если дочерний процесс неожиданно завершится, то он будет перезапущен.
