Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/services.po
Languages: ru

source: Services
ru: Сервисы

source: ``Services`` is an abstraction to help organize lots of different tasks in one process. Each service must implement ``start()`` method and can implement ``stop()`` method.
ru: ``Сервисы`` - это абстракция, помогающая организовать множество различных задач в одном процессе. Каждый сервис должен реализовывать обязательный метод ``start()`` и опционально метод stop ().

source: Service instance should be passed to the ``entrypoint``, and will be started after the event loop has been created.
ru: Экземпляр сервиса должен быть передан в «точку входа» (entrypoint) и будет запущен после создания event loop.

source: Current event-loop will be set before ``start()`` method called. The event loop will be set as current for this thread.
ru: Текущий event-loop будет установлен до вызова метода `start()`. Event loop будет установлен для этого потока.

source: Please avoid using ``asyncio.get_event_loop()`` explicitly inside ``start()`` method. Use ``self.loop`` instead:
ru: Пожалуйста, избегайте использования ``asyncio.get_event_loop()`` явно внутри метода ``start()``. Вместо этого используйте атрибут сервиса ``self.loop``:

source: import asyncio from threading import Event from aiomisc import entrypoint, Service event = Event() class MyService(Service): async def start(self): # Send signal to entrypoint for continue running self.start_event.set() event.set() # Start service task await asyncio.sleep(3600) with entrypoint(MyService()) as loop: assert event.is_set()
ru: import asyncio from threading import Event from aiomisc import entrypoint, Service event = Event() class MyService(Service): async def start(self): # Отправляем сигнал в entrypoint что можно продолжать self.start_event.set() event.set() # Запуск чего-то полезного await asyncio.sleep(3600) with entrypoint(MyService()) as loop: assert event.is_set()

source: Method ``start()`` creates as a separate task that can run forever. But in this case ``self.start_event.set()`` should be called for notifying ``entrypoint``.
ru: Метод ``start()`` создается как отдельная задача, которая может выполняться бесконечно. Но в этом случае необходимо утановить событие вызовом ``self.start_event.set()`` для уведомления entrypoint об окончании запуска.

source: During graceful shutdown method ``stop()`` will be called first, and after that, all running tasks will be canceled (including ``start()``).
ru: Во время завершения работы сначала будет вызван метод ``stop()``, а после этого все запущенные задачи будут отменены (включая ``start()``).

source: This package contains some useful base classes for simple services writing.
ru: Этот пакет содержит несколько полезных базовых классов для написания простых сервисов.

source: ``TCPServer``
ru: Класс ``TCPServer``

source: ``TCPServer`` - it's a base class for writing TCP servers. Just implement ``handle_client(reader, writer)`` to use it.
ru: ``TCPServer`` - это базовый класс для реализации TCP сервера. Просто реализуйте ``handle_client(reader, writer)``, чтобы принимать TCP соединения.

source: ``UDPServer``
ru: Класс ``UDPServer``

source: ``UDPServer`` - it's a base class for writing UDP servers. Just implement ``handle_datagram(data, addr)`` to use it.
ru: ``UDPServer`` - это базовый класс для реализации UDP сервера. Просто реализуйте ``handle_datagram(data, addr)``, чтобы принимать UDP соединения.

source: ``TLSServer``
ru: Класс ``TLSServer``

source: ``TLSServer`` - it's a base class for writing TCP servers with TLS. Just implement ``handle_client(reader, writer)`` to use it.
ru: TLSServer - это базовый класс для написания TCP-серверов с использованием TLS. Просто реализуйте ``handle_client(reader, writer)``.

source: ``TCPClient`` - it's a base class for writing TCP clients. Just implement ``handle_connection(reader, writer)`` to use it.
ru: ``TCPServer`` - это базовый класс для реализации TCP сервера. Просто реализуйте ``handle_client(reader, writer)``, чтобы принимать TCP соединения.

source: ``TLSClient`` - it's a base class for writing TLS clients. Just implement ``handle_connection(reader, writer)`` to use it.
ru: ``TCPServer`` - это базовый класс для реализации TCP сервера. Просто реализуйте ``handle_client(reader, writer)``, чтобы принимать TCP соединения.

source: ``RobustTCPClient`` - it's a base class for writing TCP clients with auto-reconnection when connection lost. Just implement ``handle_connection(reader, writer)`` to use it.
ru: TLSServer - это базовый класс для написания TCP-серверов с использованием TLS. Просто реализуйте ``handle_client(reader, writer)``.

source: ``RobustTLSClient`` - it's a base class for writing TLS clients with auto-reconnection when connection lost. Just implement ``handle_connection(reader, writer)`` to use it.
ru: TLSServer - это базовый класс для написания TCP-серверов с использованием TLS. Просто реализуйте ``handle_client(reader, writer)``.

source: ``PeriodicService``
ru: Класс ``PeriodicService``

source: ``PeriodicService`` runs ``PeriodicCallback`` as a service and waits for the running callback to complete on the stop method. You need to use ``PeriodicService`` as a base class and override ``callback`` async coroutine method.
ru: PeriodicService запускает PeriodicCallback как сервис и ожидает завершения обратного вызова при остановке. Вам необходимо использовать PeriodicService в качестве базового класса и переопределить асинхронный метод callback.

source: Service class accepts required ``interval`` argument - periodic interval in seconds and optional ``delay`` argument - periodic execution delay in seconds (0 by default).
ru: Сервисный класс принимает обязательный аргумент ``interval`` - интервал запуска в секундах и необязательный аргумент ``delay`` - задержку первого выполнения в секундах (по умолчанию 0).

source: import aiomisc from aiomisc.service.periodic import PeriodicService class MyPeriodicService(PeriodicService): async def callback(self): log.info('Running periodic callback') # ... service = MyPeriodicService(interval=3600, delay=0) # once per hour with entrypoint(service) as loop: loop.run_forever()
ru: import aiomisc from aiomisc.service.periodic import PeriodicService class MyPeriodicService(PeriodicService): async def callback(self): log.info('Running periodic callback') # ... service = MyPeriodicService(interval=3600, delay=0) # раз в час with entrypoint(service) as loop: loop.run_forever()

source: DNS Server
ru: DNS сервис

source: The DNS server described here uses the ``aiomisc`` library, which provides utilities for asynchronous I/O operations, and the ``dnslib`` library for handling DNS records and packets. This setup is ideal for high-performance, non-blocking DNS query handling.
ru: Описанный здесь DNS-сервер использует библиотеку «aiomisc», которая предоставляет утилиты для асинхронных операций ввода-вывода, и библиотеку «dnslib» для обработки DNS-записей и пакетов. Эта настройка идеально подходит для высокопроизводительной неблокирующей обработки DNS-запросов.

source: Key Features
ru: Ключевые Характеристики

source: **Asynchronous I/O**: Utilizes asynchronous operations to handle multiple DNS queries concurrently, ensuring high performance and scalability.
ru: **Асинхронный ввод-вывод**: использует асинхронные операции для одновременной обработки нескольких DNS-запросов, обеспечивая высокую производительность и масштабируемость.

source: **UDP and TCP Support**: Supports DNS queries over both UDP and TCP protocols, making it versatile for various network configurations.
ru: **Поддержка UDP и TCP**: сервер поддерживает DNS-запросы по протоколам UDP и TCP, что делает его универсальным для различных сетевых конфигураций.

source: **``EDNS0`` Support**: Implements Extension Mechanisms for DNS (``EDNS0``) to handle larger DNS messages and extended functionalities.
ru: **Поддержка ``EDNS0``**: реализует механизмы расширения DNS (``EDNS0``) для обработки более крупных сообщений DNS и расширенных функций.

source: **Customizable DNS Records**: Allows easy configuration of DNS zones and records, enabling you to define and manage your DNS entries efficiently.
ru: **Настраиваемые записи DNS**: позволяет легко настраивать зоны и записи DNS, позволяя эффективно разрешать записи DNS и управлять ими.

source: Prerequisites
ru: Пререквизиты

source: Install the required libraries using pip:
ru: Установите необходимые библиотеки с помощью pip:

source: Setting Up the Server
ru: Настройка сервера

source: Testing the Server
ru: Тестирование сервера

source: You can test the DNS server using tools like ``dig``. For example, to query the A and AAAA records for ``test.``, use the following commands:
ru: Вы можете протестировать DNS-сервер, используя такие инструменты, как «dig». Например, чтобы запросить записи A и AAAA для ``test.``, используйте следующие команды:

source: These commands should return the IP addresses ``10.10.10.10`` and ``fd10::10`` respectively, confirming that the DNS server is working correctly.
ru: Эти команды должны вернуть IP-адреса ``10.10.10.10`` и ``fd10::10`` соответственно, значит DNS-сервер работает правильно.

source: Dynamic Store Management
ru: Динамическое управление хранилищем записей

source: One of the powerful features of this DNS server setup is the ability to dynamically manage the DNS store. This allows you to add or remove zones and records at runtime, without needing to restart the server.
ru: Одной из мощных функций этой реализации DNS-сервера является возможность динамического управления хранилищем записей DNS. Это позволяет добавлять или удалять зоны и записи во время выполнения без необходимости перезапуска сервера.

source: Managing DNS zones and records dynamically is essential for a flexible DNS server setup. This guide focuses on how to manipulate DNS zones and records using the ``DNSStore`` and ``DNSZone`` classes, providing practical examples for each operation.
ru: Динамическое управление DNS-зонами и записями необходимо для гибкой настройки DNS-сервера. В этом руководстве основное внимание уделяется управлению зонами и записями DNS с помощью классов DNSStore и DNSZone, а также приведены практические примеры для каждой операции.

source: Adding a Zone
ru: Добавление зоны

source: You can add a new zone to the ``DNSStore`` to manage its records. This operation ensures that the zone is available for DNS queries.
ru: Вы можете добавить новую зону в DNSStore для управления ее записями. Эта операция гарантирует, что зона доступна для DNS-запросов.

source: Removing a Zone
ru: Удаление зоны

source: Removing a zone from the ``DNSStore`` ensures it is no longer available for DNS queries.
ru: Удаление зоны из DNSStore гарантирует, что она больше не будет доступна для запросов DNS.

source: Adding a Record to a Zone
ru: Добавление записей в зону

source: To manage DNS entries, you can add records to a specific zone. This operation makes the record available for DNS resolution within that zone.
ru: Для управления записями DNS вы можете добавлять записи в определенную зону. Эта операция делает запись доступной для разрешения DNS в этой зоне.

source: Querying Records
ru: Запрос DNS записей

source: You can query the ``DNSStore`` to retrieve records for a specific domain name. This is useful to verify if a record exists or to handle DNS queries.
ru: Вы можете запросить DNSStore для получения записей для определенного доменного имени. Это полезно для проверки существования записи или для обработки DNS-запросов.

source: Handling Duplicate Zones
ru: Обработка дубликатов зон

source: Attempting to add a zone that already exists should raise an error, ensuring that each zone is unique within the ``DNSStore``.
ru: Попытка добавить уже существующую зону должна вызвать ошибку, гарантируя уникальность каждой зоны в DNSStore.

source: Removing a Nonexistent Zone
ru: Удаление несуществующей зоны

source: Removing a zone that does not exist should raise an error, indicating that the operation is invalid.
ru: Удаление несуществующей зоны должно вызвать ошибку, указывающую на недопустимость операции.

source: Querying Subdomains
ru: Запросы поддоменов

source: The ``DNSStore`` supports querying subdomains, allowing you to resolve records within subdomains of an existing zone.
ru: ``DNSStore`` поддерживает запросы к субдоменам, что позволяет вам разрешать записи внутри субдоменов существующей зоны.

source: Retrieving a Zone
ru: Получение зоны

source: You can retrieve a zone from the ``DNSStore`` to inspect or manipulate it further.
ru: Вы можете получить зону из ``DNSStore``, чтобы проверить ее или управлять ею.

source: Handling Nonexistent Zones
ru: Обработка несуществующих зон

source: Retrieving a zone that does not exist should return ``None``.
ru: При получении несуществующей зоны должно возвращаться значение ``None``.

source: Removing a Record from a Zone
ru: Удаление записи из зоны

source: To remove a DNS record from a zone, you can use the ``remove_record`` method. This operation ensures the record is no longer available for DNS resolution.
ru: Чтобы удалить запись DNS из зоны, вы можете использовать метод ``remove_record``. Эта операция гарантирует, что запись больше не будет доступна для разрешения DNS.

source: Finding Zone by Prefix
ru: Поиск зоны по префиксу

source: The ``DNSStore`` can find the appropriate zone for a given domain name, which is useful for handling queries with subdomains.
ru: ``DNSStore`` может найти подходящую зону для данного доменного имени, что полезно для обработки запросов с поддоменами.

source: ``CronService``
ru: Класс ``CronService``

source: ``CronService`` runs ``CronCallback's`` as a service and waits for running callbacks to complete on the stop method.
ru: ``CronService`` запускает ``CronCallback`` в качестве сервиса и ожидает завершения выполнения обратных вызовов при остановке.

source: It's based on croniter_. You can register async coroutine method with ``spec`` argument - cron like format:
ru: Основан на croniter_. Вы можете зарегистрировать асинхронный метод с аргументом ``spec`` - формат, подобный cron:

source: requires installed croniter_:
ru: необходимо установить библиотеку croniter_:

source: or using extras:
ru: или как дополнительную зависимость

source: import aiomisc from aiomisc.service.cron import CronService async def callback(): log.info('Running cron callback') # ... service = CronService() service.register(callback, spec="0 * * * *") # every hour at zero minutes with entrypoint(service) as loop: loop.run_forever()
ru: import aiomisc from aiomisc.service.cron import CronService async def callback(): log.info('Running cron callback') # ... service = CronService() service.register(callback, spec="0 * * * *") # каждый час в 0 минут minutes with entrypoint(service) as loop: loop.run_forever()

source: You can also inherit from ``CronService``, but remember that callback registration should be proceeded before start
ru: Вы также можете наследовать от ``CronService``, но помните, что регистрация обратного вызова должна выполняться до запуска

source: Multiple services
ru: Несколько сервисов

source: Pass several service instances to the ``entrypoint`` to run all of them. After exiting the entrypoint service instances will be gracefully shut down.
ru: Передайте несколько экземпляров сервиса в ``entrypoint``, чтобы запустить их все сразу. После выхода экземпляры сервиса точки входа будут корректно закрыты вызовом метода ``stop()`` или через отмену метода ``start()``.

source: Configuration
ru: Конфигурация

source: ``Service`` metaclass accepts all kwargs and will set it to ``self`` as attributes.
ru: Метакласс ``Service`` принимает все именованные аргументы в ``__init__`` и устанавливает из как атрибуты в ``self``.

source: import asyncio from aiomisc import entrypoint from aiomisc.service import Service, TCPServer, UDPServer class LoggingService(Service): # required kwargs __required__ = frozenset({'name'}) # default value delay: int = 1 async def start(self): self.start_event.set() while True: # attribute ``name`` from kwargs # must be defined when instance initializes print('Hello from service', self.name) # attribute ``delay`` from kwargs await asyncio.sleep(self.delay) services = ( LoggingService(name='#1'), LoggingService(name='#2', delay=3), ) with entrypoint(*services) as loop: loop.run_forever()
ru: import asyncio from aiomisc import entrypoint from aiomisc.service import Service, TCPServer, UDPServer class LoggingService(Service): # обязательные именованные аргументы __required__ = frozenset({'name'}) # default value delay: int = 1 async def start(self): self.start_event.set() while True: # аттрибут ``name`` из именованных аргументов # должен быть передан при создании экземпляра print('Hello from service', self.name) # аттрибут ``delay`` из именованных аргументов await asyncio.sleep(self.delay) services = ( LoggingService(name='#1'), LoggingService(name='#2', delay=3), ) with entrypoint(*services) as loop: loop.run_forever()

source: aiohttp service
ru: aiohttp сервис

source: requires installed aiohttp:
ru: требуется установленная библиотека aiohttp

source: aiohttp application can be started as a service:
ru: Приложение aiohttp может быть запущено как сервис:

source: Class ``AIOHTTPSSLService`` is similar to ``AIOHTTPService`` but creates an HTTPS server. You must pass SSL-required options (see ``TLSServer`` class).
ru: Класс ``AIOHTTPSSLService`` похож на ``AIOHTTPService``, но создает HTTPS сервер. Вы должны передать требуемые для SSL параметры (см. Класс TLSServer).

source: asgi service
ru: asgi сервис

source: requires installed aiohttp-asgi:
ru: требуется установленная библиотека aiohttp-asgi:

source: Any ASGI-like application can be started as a service:
ru: Любое ASGI совместимое приложение может быть запущено как сервис:

source: Class ``ASGIHTTPSSLService`` is similar to ``ASGIHTTPService`` but creates HTTPS server. You must pass SSL-required options (see ``TLSServer`` class).
ru: Класс ``ASGIHTTPSSLService`` похож на ``ASGIHTTPService``, но создает HTTPS сервер. Вы должны передать требуемые для SSL параметры (см. Класс ``TLSServer``).

source: uvicorn service
ru: uvicorn сервис

source: requires installed uvicorn:
ru: необходимо установить библиотеку uvicorn_:

source: Any ASGI-like application can be started via uvicorn as a service:
ru: Любое ASGI совместимое приложение может быть запущено через uvicorn как сервис:

source: GRPC service
ru: GRPC сервис

source: This is an example of a GRPC service which is defined in a file and loads a `hello.proto` file without code generation, this example is one of the examples from `grpcio`, the other examples will work as expected.
ru: Это пример GRPC-сервиса, который определяется в файле и загружает файл `hello.proto` без кодогенерации, этот пример является одним из примеров из `grpcio`, остальные примеры будут работать как ожидается.

source: Proto definition:
ru: Определение proto файла

source: syntax = "proto3"; package helloworld; // The greeting service definition. service Greeter { // Sends a greeting rpc SayHello (HelloRequest) returns (HelloReply) {} } // The request message containing the user's name. message HelloRequest { string name = 1; } // The response message containing the greetings message HelloReply { string message = 1; }
ru: syntax = "proto3"; package helloworld; // Определение сервиса приветствия. service Greeter { // Сказать привет rpc SayHello (HelloRequest) returns (HelloReply) {} } // Сообщение запроса, содержащее имя пользователя. message HelloRequest { string name = 1; } // Ответное сообщение, содержащее приветствие message HelloReply { string message = 1; }

source: Service initialization example:
ru: Пример инициализации сервиса:

source: Memory Tracer
ru: Трассировщик памяти

source: Simple and useful service for logging large python objects allocated in memory.
ru: Простой и полезный сервис для логирования больших объектов Python, размещенных в памяти.

source: Output example:
ru: Пример вывода:

source: Profiler
ru: ``Profiler`` - профилировщик

source: Simple service for profiling. Optional `path` argument can be provided to dump complete profiling data, which can be later used by, for example, snakeviz. Also can change ordering with the `order` argument ("cumulative" by default).
ru: Простой сервис для профилирования. Необязательный аргумент `path` может быть предоставлен для выгрузки полных данных профилирования, которые позже могут быть использованы, например, snakeviz. Также можно изменить порядок с аргументом ``order`` (по умолчанию "cumulative").

source: Raven service
ru: Raven сервис

source: Simple service for sending unhandled exceptions to the `sentry`_ service instance.
ru: Простой сервис для отправки необработанных исключений в сервис `sentry`_.

source: Simple example:
ru: Простой пример:

source: import asyncio import logging import sys from aiomisc import entrypoint from aiomisc.version import __version__ from aiomisc.service.raven import RavenSender async def main(): while True: await asyncio.sleep(1) try: 1 / 0 except ZeroDivisionError: logging.exception("Exception") raven_sender = RavenSender( sentry_dsn=( "https://583ca3b555054f80873e751e8139e22a@o429974.ingest.sentry.io/" "5530251" ), client_options=dict( # Got environment variable SENTRY_NAME by default name="example-from-aiomisc", # Got environment variable SENTRY_ENVIRONMENT by default environment="simple_example", # Got environment variable SENTRY_RELEASE by default release=__version__, ) ) with entrypoint(raven_sender) as loop: loop.run_until_complete(main())
ru: import asyncio import logging import sys from aiomisc import entrypoint from aiomisc.version import __version__ from aiomisc.service.raven import RavenSender async def main(): while True: await asyncio.sleep(1) try: 1 / 0 except ZeroDivisionError: logging.exception("Exception") raven_sender = RavenSender( sentry_dsn=( "https://583ca3b555054f80873e751e8139e22a@o429974.ingest.sentry.io/" "5530251" ), client_options=dict( # По умолчанию возьмет значение переменной окружения SENTRY_NAME name="example-from-aiomisc", # По умолчанию возьмет значение переменной окружения SENTRY_ENVIRONMENT environment="simple_example", # По умолчанию возьмет значение переменной окружения SENTRY_RELEASE release=__version__, ) ) with entrypoint(raven_sender) as loop: loop.run_until_complete(main())

source: Full configuration:
ru: Все опции для клиента:
