Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/threads.po
Languages: ru

source: Working with threads
ru: Работа с потоками

source: Why use threads with asyncio?
ru: Зачем использовать потоки с asyncio?

source: Asyncio is designed for non-blocking I/O operations, but many libraries and operations are inherently blocking:
ru: Asyncio предназначен для неблокирующих операций ввода-вывода, но многие библиотеки и операции по своей природе блокирующие:

source: File I/O (reading/writing files)
ru: Файловый ввод-вывод (чтение/запись файлов)

source: CPU-intensive computations
ru: Ресурсоёмкие вычисления

source: Legacy libraries without async support
ru: Старые библиотеки без поддержки async

source: Database drivers without async support
ru: Драйверы баз данных без поддержки async

source: System calls that don't have async alternatives
ru: Системные вызовы без асинхронных альтернатив

source: Running blocking code directly in an async function blocks the entire event loop, preventing other coroutines from executing. The solution is to run blocking code in separate threads while the event loop continues processing other tasks.
ru: Выполнение блокирующего кода напрямую в async-функции блокирует весь event loop, не давая выполняться другим сопрограммам. Решение — запускать блокирующий код в отдельных потоках, пока event loop продолжает обрабатывать другие задачи.

source: aiomisc provides convenient decorators and utilities to seamlessly integrate blocking code with asyncio, powered by the `aiothreads`_ library.
ru: aiomisc предоставляет удобные декораторы и утилиты для бесшовной интеграции блокирующего кода с asyncio на базе библиотеки `aiothreads`_.

source: Quick reference
ru: Краткий справочник

source: Decorator/Class
ru: Декоратор/Класс

source: Use case
ru: Применение

source: Run blocking function in thread pool
ru: Запуск блокирующей функции в пуле потоков

source: Run blocking function in new thread
ru: Запуск блокирующей функции в новом потоке

source: Async iterate over blocking generator
ru: Асинхронная итерация по блокирующему генератору

source: Same, but on separate thread
ru: То же, но в отдельном потоке

source: Wrap existing generator for async iteration
ru: Обёртка существующего генератора для асинхронной итерации

source: Call async function from thread
ru: Вызов async-функции из потока

source: Send data from thread to async code
ru: Отправка данных из потока в async-код

source: Wraps a blocking function to run it in the current thread pool. The decorated function becomes awaitable.
ru: Оборачивает блокирующую функцию для выполнения в текущем пуле потоков. Декорированная функция становится awaitable.

source: Basic usage
ru: Базовое использование

source: import asyncio import time from aiomisc import threaded @threaded def blocking_function(): time.sleep(1) return "done" async def main(): # Run two blocking calls in parallel results = await asyncio.gather( blocking_function(), blocking_function(), ) print(results) # ['done', 'done'] asyncio.run(main())
ru: import asyncio import time from aiomisc import threaded @threaded def blocking_function(): time.sleep(1) return "done" async def main(): # Запуск двух блокирующих вызовов параллельно results = await asyncio.gather( blocking_function(), blocking_function(), ) print(results) # ['done', 'done'] asyncio.run(main())

source: Calling modes
ru: Способы вызова

source: The ``@threaded`` decorator returns a ``Threaded`` object with multiple calling methods:
ru: Декоратор ``@threaded`` возвращает объект ``Threaded`` с несколькими способами вызова:

source: import time from aiomisc import threaded @threaded def blocking_function(): time.sleep(0.1) return "result" async def main(): # Async call (returns coroutine) result = await blocking_function() # Explicit async call result = await blocking_function.async_call() # Synchronous call (blocks current thread) result = blocking_function.sync_call()
ru: import time from aiomisc import threaded @threaded def blocking_function(): time.sleep(0.1) return "result" async def main(): # Асинхронный вызов (возвращает корутину) result = await blocking_function() # Явный асинхронный вызов result = await blocking_function.async_call() # Синхронный вызов (блокирует текущий поток) result = blocking_function.sync_call()

source: Works with methods
ru: Работа с методами

source: The decorator works correctly with instance methods, class methods, and static methods:
ru: Декоратор корректно работает с методами экземпляра, методами класса и статическими методами:

source: Wraps a blocking function to run it in a new separate thread (not from pool). Use this for long-running background tasks that would otherwise occupy a thread pool slot for extended periods.
ru: Оборачивает блокирующую функцию для выполнения в новом отдельном потоке (не из пула). Используйте для долгих фоновых задач, которые иначе бы занимали слот в пуле потоков на длительное время.

source: import asyncio import time import threading import aiomisc @aiomisc.threaded def quick_task(): """Short task - uses thread pool""" time.sleep(0.1) return "quick" @aiomisc.threaded_separate def long_running_task(stop_event: threading.Event): """Long task - runs in dedicated thread""" while not stop_event.is_set(): print("Working...") time.sleep(1) return "finished" async def main(): stop_event = threading.Event() # Schedule stop after 5 seconds loop = asyncio.get_event_loop() loop.call_later(5, stop_event.set) # Both run concurrently results = await asyncio.gather( quick_task(), long_running_task(stop_event), ) print(results) # ['quick', 'finished'] with aiomisc.entrypoint() as loop: loop.run_until_complete(main())
ru: import asyncio import time import threading import aiomisc @aiomisc.threaded def quick_task(): """Короткая задача - использует пул потоков""" time.sleep(0.1) return "quick" @aiomisc.threaded_separate def long_running_task(stop_event: threading.Event): """Длинная задача - запускается в выделенном потоке""" while not stop_event.is_set(): print("Работаю...") time.sleep(1) return "finished" async def main(): stop_event = threading.Event() # Запланировать остановку через 5 секунд loop = asyncio.get_event_loop() loop.call_later(5, stop_event.set) # Обе задачи выполняются параллельно results = await asyncio.gather( quick_task(), long_running_task(stop_event), ) print(results) # ['quick', 'finished'] with aiomisc.entrypoint() as loop: loop.run_until_complete(main())

source: Threaded iterators
ru: Потоковые итераторы

source: Wraps a blocking generator function to make it async-iterable. The generator runs in a thread pool while yielding values to async code.
ru: Оборачивает блокирующую функцию-генератор, делая её асинхронно-итерируемой. Генератор выполняется в пуле потоков, передавая значения в async-код.

source: The generator uses lazy start - execution begins only when iteration starts (first ``async for`` or ``__anext__()`` call), not when entering the async context manager.
ru: Генератор использует отложенный запуск - выполнение начинается только при старте итерации (первый вызов ``async for`` или ``__anext__()``), а не при входе в асинхронный контекстный менеджер.

source: import asyncio import aiomisc @aiomisc.threaded_iterable def read_large_file(path): """Read file line by line without blocking event loop""" with open(path, 'r') as f: for line in f: yield line.strip() async def main(): async with read_large_file('/etc/hosts') as lines: async for line in lines: print(line) asyncio.run(main())
ru: import asyncio import aiomisc @aiomisc.threaded_iterable def read_large_file(path): """Чтение файла построчно без блокировки event loop""" with open(path, 'r') as f: for line in f: yield line.strip() async def main(): async with read_large_file('/etc/hosts') as lines: async for line in lines: print(line) asyncio.run(main())

source: Buffer size control
ru: Управление размером буфера

source: Use ``max_size`` parameter to control backpressure. The generator thread will block when the buffer is full:
ru: Используйте параметр ``max_size`` для управления обратным давлением. Поток генератора будет заблокирован, когда буфер заполнен:

source: import aiomisc # Buffer holds at most 2 items @aiomisc.threaded_iterable(max_size=2) def produce_data(): for i in range(1000): yield i # Blocks when 2 items buffered
ru: import aiomisc # Буфер содержит максимум 2 элемента @aiomisc.threaded_iterable(max_size=2) def produce_data(): for i in range(1000): yield i # Блокируется при 2 элементах в буфере

source: Same as ``@threaded_iterable`` but runs in a dedicated thread instead of the thread pool. Use for long-running generators:
ru: То же, что и ``@threaded_iterable``, но выполняется в выделенном потоке вместо пула потоков. Используйте для долгих генераторов:

source: import aiomisc @aiomisc.threaded_iterable_separate def tail_file(path): """Continuously read new lines from file""" with open(path, 'r') as f: f.seek(0, 2) # Go to end while True: line = f.readline() if line: yield line.strip()
ru: import aiomisc @aiomisc.threaded_iterable_separate def tail_file(path): """Непрерывное чтение новых строк из файла""" with open(path, 'r') as f: f.seek(0, 2) # Перейти в конец while True: line = f.readline() if line: yield line.strip()

source: Cleanup with context managers
ru: Очистка с помощью контекстных менеджеров

source: For infinite generators, always use async context manager or call ``.close()``:
ru: Для бесконечных генераторов всегда используйте асинхронный контекстный менеджер или вызывайте ``.close()``:

source: import aiomisc @aiomisc.threaded_iterable(max_size=2) def infinite_generator(): counter = 0 while True: yield counter counter += 1 async def main(): # Option 1: Context manager (recommended) async with infinite_generator() as gen: async for value in gen: if value >= 10: break # Context manager handles cleanup # Option 2: Manual cleanup gen = infinite_generator() async for value in gen: if value >= 10: break await gen.close() # Must call close!
ru: import aiomisc @aiomisc.threaded_iterable(max_size=2) def infinite_generator(): counter = 0 while True: yield counter counter += 1 async def main(): # Вариант 1: Контекстный менеджер (рекомендуется) async with infinite_generator() as gen: async for value in gen: if value >= 10: break # Контекстный менеджер очистит ресурсы # Вариант 2: Ручная очистка gen = infinite_generator() async for value in gen: if value >= 10: break await gen.close() # Обязательно вызвать close!

source: Wraps an existing generator to make it async-iterable. Useful when you can't use decorators or need to specify a custom executor:
ru: Оборачивает существующий генератор, делая его асинхронно-итерируемым. Полезно, когда нельзя использовать декораторы или нужно указать свой executor:

source: import concurrent.futures import aiomisc def my_generator(): for i in range(100): yield i async def main(): # Use default thread pool wrapper = aiomisc.IteratorWrapper( my_generator, max_size=10 ) async with wrapper as gen: async for item in gen: print(item) # Or use custom thread pool pool = concurrent.futures.ThreadPoolExecutor(2) wrapper = aiomisc.IteratorWrapper( my_generator, executor=pool, max_size=10 ) async with wrapper as gen: async for item in gen: print(item) pool.shutdown()
ru: import concurrent.futures import aiomisc def my_generator(): for i in range(100): yield i async def main(): # Использовать пул потоков по умолчанию wrapper = aiomisc.IteratorWrapper( my_generator, max_size=10 ) async with wrapper as gen: async for item in gen: print(item) # Или использовать свой пул потоков pool = concurrent.futures.ThreadPoolExecutor(2) wrapper = aiomisc.IteratorWrapper( my_generator, executor=pool, max_size=10 ) async with wrapper as gen: async for item in gen: print(item) pool.shutdown()

source: Same as ``IteratorWrapper`` but runs the generator in a dedicated thread:
ru: То же, что и ``IteratorWrapper``, но запускает генератор в выделенном потоке:

source: Calling async from threads
ru: Вызов async из потоков

source: Execute an async function synchronously from a thread. Automatically detects the running event loop:
ru: Выполняет async-функцию синхронно из потока. Автоматически определяет запущенный event loop:

source: import asyncio import aiomisc async def async_operation(): await asyncio.sleep(0.1) return "async result" @aiomisc.threaded def thread_function(): # Call async function from thread result = aiomisc.sync_await(async_operation()) return f"got: {result}" async def main(): result = await thread_function() print(result) # got: async result with aiomisc.entrypoint() as loop: loop.run_until_complete(main())
ru: import asyncio import aiomisc async def async_operation(): await asyncio.sleep(0.1) return "async result" @aiomisc.threaded def thread_function(): # Вызов async-функции из потока result = aiomisc.sync_await(async_operation()) return f"got: {result}" async def main(): result = await thread_function() print(result) # got: async result with aiomisc.entrypoint() as loop: loop.run_until_complete(main())

source: Lower-level function that requires explicit loop argument:
ru: Низкоуровневая функция, требующая явный аргумент loop:

source: import asyncio import aiomisc async def fetch_data(): await asyncio.sleep(0.1) return {"key": "value"} @aiomisc.threaded def process_in_thread(loop): # Explicit loop argument data = aiomisc.sync_wait_coroutine(loop, fetch_data()) return data["key"] with aiomisc.entrypoint() as loop: result = loop.run_until_complete(process_in_thread(loop)) print(result) # value
ru: import asyncio import aiomisc async def fetch_data(): await asyncio.sleep(0.1) return {"key": "value"} @aiomisc.threaded def process_in_thread(loop): # Явный аргумент loop data = aiomisc.sync_wait_coroutine(loop, fetch_data()) return data["key"] with aiomisc.entrypoint() as loop: result = loop.run_until_complete(process_in_thread(loop)) print(result) # value

source: A channel for sending data from threads to async code. Unlike ``IteratorWrapper``, you control when and what to send:
ru: Канал для отправки данных из потоков в async-код. В отличие от ``IteratorWrapper``, вы контролируете когда и что отправлять:

source: import asyncio import aiomisc async def consumer(channel: aiomisc.FromThreadChannel): async for item in channel: print(f"Received: {item}") @aiomisc.threaded_separate def producer(channel: aiomisc.FromThreadChannel): for i in range(5): channel.put(i) # Send to async consumer channel.close() # Signal end of data async def main(): channel = aiomisc.FromThreadChannel(max_size=2) await asyncio.gather( consumer(channel), producer(channel), ) asyncio.run(main())
ru: import asyncio import aiomisc async def consumer(channel: aiomisc.FromThreadChannel): async for item in channel: print(f"Получено: {item}") @aiomisc.threaded_separate def producer(channel: aiomisc.FromThreadChannel): for i in range(5): channel.put(i) # Отправка в async-потребитель channel.close() # Сигнал о конце данных async def main(): channel = aiomisc.FromThreadChannel(max_size=2) await asyncio.gather( consumer(channel), producer(channel), ) asyncio.run(main())

source: ``contextvars`` support
ru: Поддержка ``contextvars``

source: All decorators automatically copy context variables to the thread:
ru: Все декораторы автоматически копируют контекстные переменные в поток:

source: import asyncio import contextvars import aiomisc request_id = contextvars.ContextVar("request_id") @aiomisc.threaded def log_with_context(message): print(f"[{request_id.get()}] {message}") async def handle_request(req_id): request_id.set(req_id) await log_with_context("Processing request") async def main(): await asyncio.gather( handle_request("req-001"), handle_request("req-002"), handle_request("req-003"), ) asyncio.run(main())
ru: import asyncio import contextvars import aiomisc request_id = contextvars.ContextVar("request_id") @aiomisc.threaded def log_with_context(message): print(f"[{request_id.get()}] {message}") async def handle_request(req_id): request_id.set(req_id) await log_with_context("Обработка запроса") async def main(): await asyncio.gather( handle_request("req-001"), handle_request("req-002"), handle_request("req-003"), ) asyncio.run(main())

source: Output::
ru: Вывод::

source: Context variables are copied to threads, so modifications in threads don't affect the parent context.
ru: Контекстные переменные копируются в потоки, поэтому изменения в потоках не влияют на родительский контекст.

source: A fast thread pool implementation used by aiomisc internally.
ru: Быстрая реализация пула потоков, используемая внутри aiomisc.

source: Manual setup:
ru: Ручная настройка:

source: The ``entrypoint`` context manager sets this automatically. Use the ``pool_size`` argument to control thread pool size:
ru: Контекстный менеджер ``entrypoint`` устанавливает это автоматически. Используйте аргумент ``pool_size`` для управления размером пула потоков:
