Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: ru

source: The following recommendations for calling blocking functions in threads given in `working with threads`_ section in official Python documentation:
ru: В разделе `working with threads`_ официальной документации по python даются следующие рекомендации по вызову блокирующих функций в потоках:

source: import asyncio def blocking_io(): # File operations (such as logging) can block the event loop. with open('/dev/urandom', 'rb') as f: return f.read(100) async def main(): loop = asyncio.get_running_loop() result = await loop.run_in_executor(None, blocking_io) asyncio.run(main())
ru: import asyncio def blocking_io(): # Файловые операции (такие как логирование) могут заблокировать event loop. with open('/dev/urandom', 'rb') as f: return f.read(100) async def main(): loop = asyncio.get_running_loop() result = await loop.run_in_executor(None, blocking_io) asyncio.run(main())

source: This library provides a very simple way to do the same:
ru: Эта библиотека содержит очень простой способ сделать тоже самое:

source: As you can see in this example, it is enough to wrap the function with a decorator ``aiomisc.threaded``, after that it will return an awaitable object, but the code inside the function will be sent to the default thread pool.
ru: Как видно из этого примера, достаточно обернуть функцию декоратором ``aiomisc.threaded``, и она начнет возвращать awaitable объект, но код внутри функции будет отправлен в пул потоков по умолчанию.

source: ``@aiomisc.threaded_separate`` decorator
ru: Декоратор ``@aiomisc.threaded_separate``

source: If the blocking function runs for a long time, or even indefinitely, in other words, if the cost of creating a thread is insignificant compared to the workload, then you can use the decorator ``aiomisc.threaded_separate``.
ru: Если блокирующая функция работает долго, а то и бесконечно долго, иными словами, если стоимость создания потока незначительна по сравнению с сколько функция работает, то можно попробовать использовать декоратор ``aiomisc.threaded_separate``.

source: The decorator starts a new thread not associated with any pool. Тhe thread will be terminated after the function execution is done.
ru: Декоратор запускает новый поток, не связанный с каким-либо пулом потоков. Поток завершится после выхода из функции.

source: import hashlib import aiomisc @aiomisc.threaded_separate def another_one_useless_coin_miner(): with open('/dev/urandom', 'rb') as f: hasher = hashlib.sha256() while True: hasher.update(f.read(1024)) if hasher.hexdigest().startswith("0000"): return hasher.hexdigest() async def main(): print( "the hash is", await another_one_useless_coin_miner() ) aiomisc.run(main())
ru: import hashlib import aiomisc @aiomisc.threaded_separate def another_one_useless_coin_miner(): with open('/dev/urandom', 'rb') as f: hasher = hashlib.sha256() while True: hasher.update(f.read(1024)) if hasher.hexdigest().startswith("0000"): return hasher.hexdigest() async def main(): print( "Хэш получился вот такой:", await another_one_useless_coin_miner() ) aiomisc.run(main())

source: This approach allows you not to occupy threads in the pool for a long time, but at the same time does not limit the number of created threads in any way.
ru: Такой подход позволяет не занимать потоки в пуле надолго, но при этом никак не ограничивает количество создаваемых потоков.

source: More examples you can be found in :doc:`/threads`.
ru: Больше примеров можно найти на странице :doc:`/threads`

source: ``@aiomisc.threaded_iterable`` decorator
ru: Декоратор ``@aiomisc.threaded_iterable``

source: If a generator needs to be executed in a thread, there are problems with synchronization of the thread and the eventloop. This library provides a custom decorator designed to turn a synchronous generator into an asynchronous one.
ru: Если генератор нужно выполнить в потоке, возникают проблемы с синхронизацией потока и eventloop. Эта библиотека предоставляет пользовательский декоратор, предназначенный для превращения синхронного генератора в асинхронный.

source: This is very useful if, for example, a queue or database driver has written synchronous, but you want to use it efficiently in asynchronous code.
ru: Это очень полезно, если, например, драйвер очереди или базы данных синхронный, но вы хотите эффективно использовать его в асинхронном коде.

source: Under the hood, this decorator returns a special object that has a queue, and asynchronous iterator interface provides access to that queue.
ru: Под капотом этот декоратор возвращает специальный объект с очередью, а интерфейс асинхронного итератора обеспечивает доступ к этой очереди.

source: You should always specify the ``max_size`` parameter, which limits the size of this queue and prevents threaded code from sending too much items to asynchronous code, in case the asynchronous iteration in case the asynchronous iteration slacking.
ru: Всегда следует указывать параметр ``max_size``, который ограничивает размер этой очереди и предотвращает отправку кода, который работает в потоке, слишком большого количества элементов в асинхронный код, в случае асинхронной итерации в случае, если асинхронный итератор забирает элементы из этой очереди реже чем они поступают.

source: Conclusion
ru: Заключение

source: On this we need to finish this tutorial, I hope everything was clear here, and you learned a lot of useful things for yourself. A full description of the remaining services is presented in the :doc:`/modules` section, or in the source code. The authors have tried to make the source code as clear and simple as possible, so feel free to explore it.
ru: На этом нам нужно закончить этот учебник, надеюсь тут все было понятно, и вы почерпнули для себя много полезного. Полное описание остальных сервисов представлено в разделе :doc:`/modules`, или в исходном коде. Авторы постарались сделать исходный код максимально понятным и простым, поэтому не стесняйтесь исследовать его.
