Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/tutorial.po
Languages: ru

source: Tutorial
ru: Учебник

source: ``aiomisc`` is a Python library that provides a set of utilities for building asynchronous services. It allows you to split your program into smaller, independent services that can run concurrently, improving the overall performance and scalability of your application.
ru: ``aiomisc`` — это библиотека Python, которая предоставляет набор утилит для создание асинхронных сервисов. Это позволяет вам разделить вашу программу на небольшие независимые службы, которые могут работать одновременно, улучшая общую производительность и масштабируемость вашего приложения.

source: The main approach in this library is to split your program into independent services that can work concurrently in asynchronous mode. The library also provides a set of ready-to-use services with pre-written start and stop logic.
ru: Основным подходом в этой библиотеке является разделение вашей программы на независимые сервисы, которые могут работать конкурентно в асинхронном режиме. Библиотека также предоставляет набор готовых к использованию сервисов с заранее написанной логикой запуска и остановки.

source: The vast majority of functions and classes are written in such a way that they can be used in a program that was not originally designed according to the principles outlined in this manual. This means that if you don't plan to modify your code too much, but only use a few useful functions or classes, then everything should work.
ru: Подавляющее большинство функций и классов написаны таким образом, что их можно использовать в программе, которая изначально не была разработана в соответствии с принципами, изложенными в этом руководстве. Так что если вы не планируете слишком сильно переписывать свой код, а хотите использовать только несколько полезных для вас функций или классов, то все должно работать.

source: Overall, aiomisc is a powerful tool for developers looking to build efficient and scalable asynchronous services in Python.
ru: В целом, aiomisc — это мощный инструмент для разработчиков, стремящихся создавать эффективные и масштабируемые асинхронные сервисы на Python.

source: Services
ru: Сервисы

source: If you want to run a tcp or web server, you will have to write something like this:
ru: Если вы хотите запустить tcp или веб-сервер, вам придется написать что-то вроде этого:

source: import asyncio async def example_async_func(): # do my async business logic await init_db() await init_cache() await start_http_server() await start_metrics_server() loop = asyncio.get_event_loop() loop.run_until_complete(example_async_func()) # Continue running all background tasks loop.run_forever()
ru: import asyncio async def example_async_func(): # Делаем что-то асинхронное и очень важное await init_db() await init_cache() await start_http_server() await start_metrics_server() loop = asyncio.get_event_loop() loop.run_until_complete(example_async_func()) # Продолжаем выполнение асинхронных задач loop.run_forever()

source: In order to start or stop an async programs, usually using function ``asyncio.run(example_async_func())`` which available since Python 3.7. This function takes an instance of a coroutine and cancels all still running tasks before returning a result. To continue executing the code indefinitely, you can perform the following trick:
ru: Для того, чтобы запустить или остановить асинхронные программы, обычно используется функция ``asyncio.run(example_async_func())``, которая доступна начиная с Python 3.7. Функция принимает экземпляр сопрограммы и отменяет через `cancel()` всем задачи перед тем как вернуть результат. Чтобы продолжить выполнение кода вечно, вы можете применить следующий трюк:

source: import asyncio async def example_async_func(): # do my async business logic await init_db() await init_cache() await start_http_server() await start_metrics_server() # Make future which never be done # using instead loop.run_forever() await asyncio.Future() asyncio.run(example_async_func())
ru: import asyncio async def example_async_func(): # Делаем что-то асинхронное и очень важное await init_db() await init_cache() await start_http_server() await start_metrics_server() # Создаем future которая никогда не будет завершена # используется вместо loop.run_forever() await asyncio.Future() asyncio.run(example_async_func())

source: When the user presses `Ctrl+C`, the program simply terminates, but if you want to explicitly free up some resources, for example, close database connections or rolling back incomplete transactions, then you have to do something like this:
ru: Если пользователь нажимает `Ctrl+C`, программа просто завершается, но если вы хотите явно освободить некоторые ресурсы, например, закрыть соединения с базой данных или откатить незавершенные транзакции, то вам нужно сделать что-то вроде этого:

source: import asyncio async def example_async_func(): try: # do my async business logic await init_db() await init_cache() await start_http_server() await start_metrics_server() # Make future which never be done # using instead loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Do this block when SIGTERM has been received pass finally: # Do this block on exit ... asyncio.run(example_async_func())
ru: import asyncio async def example_async_func(): try: # Делаем что-то асинхронное и очень важное await init_db() await init_cache() await start_http_server() await start_metrics_server() # Создаем future которая никогда не будет завершена # используется вместо loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Зайдем в этот блок будет когда получим SIGTERM pass finally: # Зайдем сюда перед выходом ... asyncio.run(example_async_func())

source: It is a good solution because it is implemented without any 3rd-party libraries. When your program starts to grow, you will probably want to optimize the startup time in a simple way, namely to do all initialization competitively. At first glance it seems that this code will solve the problem:
ru: Это хорошее решение, потому что оно реализовано без каких-либо сторонних библиотек. Но когда ваша программа начнет расти, вы, вероятно, захотите оптимизировать время запуска простым способом, а именно выполнить всю инициализацию конкурентно. На первый взгляд кажется, что этот код решит проблему:

source: import asyncio async def example_async_func(): try: # do my async business logic await asyncio.gather( init_db(), init_cache(), start_http_server(), start_metrics_server(), ) # Make future which never be done # using instead loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Do this block when SIGTERM has been received pass finally: # Do this block on exit ... asyncio.run(example_async_func())
ru: import asyncio async def example_async_func(): try: # Делаем что-то асинхронное и очень важное await asyncio.gather( init_db(), init_cache(), start_http_server(), start_metrics_server(), ) # Создаем future которая никогда не будет завершена # используется вместо loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Зайдем в этот блок будет когда получим SIGTERM pass finally: # Зайдем сюда перед выходом ... asyncio.run(example_async_func())

source: But if suddenly some part of the initialization does not go according to plan, then you somehow have to figure out what exactly went wrong, so with concurrent execution, the code will no longer be as simple as in this example.
ru: Но если вдруг какая-то часть инициализации пойдет не по плану, то вам каким-то образом придется выяснить, что именно пошло не так. Поэтому при конкурентном выполнении код уже не будет таким простым, как в этом примере.

source: And in order to somehow organize the code, you should make a separate function that will contain the ``try/except/finally`` block and contain error handling.
ru: И для того, чтобы как-то упорядочить код, вы должны сделать отдельную функцию, которая будет содержать блок ``try/except/finally`` и содержать обработку ошибок.

source: import asyncio async def init_db(): try: # initialize connection finally: # close connection ... async def example_async_func(): try: # do my async business logic await asyncio.gather( init_db(), init_cache(), start_http_server(), start_metrics_server(), ) # Make future which never be done # using instead loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Do this block when SIGTERM has been received # TODO: shutdown all things correctly pass finally: # Do this block on exit ... asyncio.run(example_async_func())
ru: import asyncio async def init_db(): try: # инициализируем соединение finally: # закрываем соединение ... async def example_async_func(): try: # Делаем что-то асинхронное и очень важное await asyncio.gather( init_db(), init_cache(), start_http_server(), start_metrics_server(), ) # Создаем future которая никогда не будет завершена # используется вместо loop.run_forever() await asyncio.Future() except asyncio.CancelledError: # Зайдем в этот блок будет когда получим SIGTERM # TODO: нужно как-то корректно все завершить pass finally: # Зайдем сюда перед выходом ... asyncio.run(example_async_func())

source: And now if the user presses Ctrl+C, you need to describe the shutdown logic again, but now in the ``except`` block.
ru: И теперь, если пользователь нажимает Ctrl+C, вам нужно снова описать логику завершения работы, но уже в блоке ``except``.

source: In order to describe the logic of starting and stopping in one place, as well as testing in one single way, there is a ``Service`` abstraction.
ru: Для того, чтобы описать логику запуска и остановки в одном месте, а также тестирования одним-единственным способом, и существует абстракция ``Service``.

source: The service is an abstract base class with mandatory ``start()`` and optional ``stop()`` methods.
ru: Сервис представляет из себя абстрактный базовый класс, в котором нужно реализовать метод ``start()`` и не обязательно метод ``stop()``

source: The service can operate in two modes. The first is when the ``start()`` method runs forever, then you do not need to implement a ``stop()``, but you need to report that the initialization is successfully completed by setting ``self.start_event.set()``.
ru: Сервис может работать в двух режимах. Первый это когда метод старт выполняется вечно, тогда не нужно реализовывать стоп, но нужно сообщить что инициализация успешно закончена с помощью ``self.start_event.set()``.

source: import asyncio import aiomisc class InfinityService(aiomisc.Service): async def start(self): # Service is ready self.start_event.set() while True: # do some stuff await asyncio.sleep(1)
ru: import asyncio import aiomisc class InfinityService(aiomisc.Service): async def start(self): # Сервис готов работать self.start_event.set() while True: # Делаем что-то полезное await asyncio.sleep(1)

source: In this case, stopping the service will consist in the completion of the coroutine that was created by ``start()``.
ru: В этом случае остановка сервиса будет заключаться в завершении сопрограммы которую породила ``start()``

source: The second method is an explicit description of the way to ``start()`` and ``stop()``.
ru: Второй способ это явное описание способа запуска и остановки реализовав методы ``start()`` и ``stop()``

source: import asyncio import aiomisc from typing import Any class OrdinaryService(aiomisc.Service): async def start(self): # do some stuff ... async def stop(self, exception: Exception = None) -> Any: # do some stuff ...
ru: import asyncio import aiomisc from typing import Any class OrdinaryService(aiomisc.Service): async def start(self): # Делаем что-то полезное ... async def stop(self, exception: Exception = None) -> Any: # Делаем что-то полезное ...

source: In this case, the service will be started and stopped once.
ru: В этом случае запуск и остановка сервиса будут выполнены однократно.

source: Service configuration
ru: Конфигурация сервисов

source: The ``Service`` is a metaclass, it handles the special attributes of classes inherited from it at on the their declaration stage.
ru: Так как ``Service`` это метакласс, он может обрабатывать специальные аттрибуты классов наследуемых от него на этапе объявления класса.

source: Here is a simple imperative example of how service initialization can be extended through inheritance.
ru: Вот простой императивный пример как инициализация сервиса может быть расширена через наследование.

source: from typing import Any import aiomisc class HelloService(aiomisc.Service): def __init__(self, name: str = "world", **kwargs: Any): super().__init__(**kwargs) self.name = name async def start(self) -> Any: print(f"Hello {self.name}") with aiomisc.entrypoint( HelloService(), HelloService(name="Guido") ) as loop: pass # python hello.py # <<< Hello world # <<< Hello Guido
ru: from typing import Any import aiomisc class HelloService(aiomisc.Service): def __init__(self, name: str = "мир", **kwargs: Any): super().__init__(**kwargs) self.name = name async def start(self) -> Any: print(f"Привет {self.name}") with aiomisc.entrypoint( HelloService(), HelloService(name="Гвидо") ) as loop: pass # python hello.py # <<< Привет мир # <<< Привет Гвидо

source: In fact, you can do nothing of this, since the Service metaclass sets all the passed keyword parameters to self by default.
ru: На самом деле, можно было ничего и не делать, так как метакласс установит все переданные именованные параметры в self по умолчанию.

source: import aiomisc class HelloService(aiomisc.Service): name: str = "world" async def start(self): print(f"Hello {self.name}") with aiomisc.entrypoint( HelloService(), HelloService(name="Guido") ) as loop: pass # python hello.py # <<< Hello world # <<< Hello Guido
ru: import aiomisc class HelloService(aiomisc.Service): name: str = "мир" async def start(self): print(f"Привет {self.name}") with aiomisc.entrypoint( HelloService(), HelloService(name="Гвидо") ) as loop: pass # python hello.py # <<< Привет мир # <<< Привет Гвидо

source: If a special class property ``__required__`` is declared, then the service will required for the user to declare these named parameters.
ru: Если-же объявлен специальный аттрибут ``__required__``, сервис будет требовать чтобы он был передан явно при инициализации как именованный параметр.

source: import aiomisc class HelloService(aiomisc.Service): __required__ = ("name", "title") name: str title: str async def start(self): await asyncio.sleep(0.1) print(f"Hello {self.title} {self.name}") with aiomisc.entrypoint( HelloService(name="Guido", title="mr.") ) as loop: pass
ru: import aiomisc class HelloService(aiomisc.Service): __required__ = ("name", "title") name: str title: str async def start(self): await asyncio.sleep(0.1) print(f"Привет {self.title} {self.name}") with aiomisc.entrypoint( HelloService(name="Гвидо", title="мистер") ) as loop: pass

source: Also a very useful special class attribute is ``__async_required__``. It is useful for writing base classes, in general. This contains the tuple of method names that must be declared asynchronous explicitly (via ``async def``).
ru: Также очень полезный специальным атрибут класса это ``__async_required__``. В общем, это полезно для написания базовых классов. Он содержит кортеж имен методов, которые должны быть явно объявлены асинхронными (через ``async def``).

source: import aiomisc class HelloService(aiomisc.Service): __required__ = ("name", "title") __async_required__ = ("greeting",) name: str title: str async def greeting(self) -> str: await asyncio.sleep(0.1) return f"Hello {self.title} {self.name}" async def start(self): print(await self.greeting()) class HelloEmojiService(HelloService): async def greeting(self) -> str: await asyncio.sleep(0.1) return f"🙋 {self.title} {self.name}" with aiomisc.entrypoint( HelloService(name="Guido", title="mr."), HelloEmojiService(name="👨", title="🎩") ) as loop: pass # Hello mr. Guido # 🙋 🎩 👨
ru: import aiomisc class HelloService(aiomisc.Service): __required__ = ("name", "title") __async_required__ = ("greeting",) name: str title: str async def greeting(self) -> str: await asyncio.sleep(0.1) return f"Привет {self.title} {self.name}" async def start(self): print(await self.greeting()) class HelloEmojiService(HelloService): async def greeting(self) -> str: await asyncio.sleep(0.1) return f"🙋 {self.title} {self.name}" with aiomisc.entrypoint( HelloService(name="Гвидо", title="мистер"), HelloEmojiService(name="👨", title="🎩") ) as loop: pass # Привет мистер Гвидо # 🙋 🎩 👨

source: If the inheritor declares these methods differently, there will be an error at the class declaration stage.
ru: Если наследник объявит эти методы по-другому, будет ошибка на этапе объявления класса.

source: In some cases, you need to execute some asynchronous code before the service starts, for example, to pass a database connection to the service instance. Or if you want to use one instance of some entity for several services.
ru: В некоторых случаях перед запуском службы необходимо выполнить некоторый асинхронный код, например, чтобы передать соединение с базой данных экземпляру сервиса. Или если вы хотите использовать один экземпляр какой-то сущности для нескольких сервисов.

source: For such complex configurations, there is `aiomisc-dependency`_ plugin which is distributed as a independent separate package.
ru: Для таких сложных конфигураций существует плагин `aiomisc-dependency`_, который распространяется как независимый отдельный пакет.

source: Look at the examples in the documentation, `aiomisc-dependency`_ are transparently integrates with the ``entrypoint``.
ru: Посмотрите на примеры в документации, `aiomisc-dependency`_ прозрачно интегрируется с ``entrypoint``.

source: So the service abstraction is declared, what's next? ``asyncio.run`` does not know how to work with them, calling them manually has not become easier, what can this library offer here?
ru: Итак сервисы описаны, что дальше? ``asyncio.run`` не умеет с ними работать, вызывать их вручную не стало проще, что тут можно предложить?

source: Probably the most magical, complex, and at the same time quite well-tested code in the library is ``entrypoint``. Initially, the idea of ``entrypoint`` was to get rid of the routine: setting up logs, setting up a thread pool, as well as starting and stopping services correctly.
ru: Наверное самый магический, сложный, и в то-же время достаточно хорошо протестированный код в библиотеке - это ``entrypoint``. Изначально идеей ``entrypoint`` было избавление от рутины: настройка логов, настройка пула потоков, ну и запуск и корректная остановка сервисов.

source: Lets check an example:
ru: Давайте посмотрим на пример:

source: In this example, we will launch the two services described above and continue execution until the user interrupts them. Next, thanks to the context manager, we correctly terminate all instances of services.
ru: В этом примере мы запускаем два сервиса, описанных выше, и продолжаем выполнение до тех пор пока пользователь его не прервёт. Далее, благодаря контекстному менеджеру, мы корректно завершаем все экземпляры сервисов.

source: Entrypoint calls all the ``start()`` methods in all services concurrently, and if at least one of them fails, then all services will be stopped.
ru: Entrypoint вызывает все методы ``start()`` во всех сервисах конкурентно, и если хотя-бы один из них упадет, все остальные сервисы будут остановлены.

source: As mentioned above I just wanted to remove a lot of routine, let's look at the same example, just pass all the default parameters to the ``entrypoint`` explicitly.
ru: Я упоминал, что я хотел убрать много рутины, давайте посмотрим на тот же пример, только передадим явно все параметры по умолчанию в ``entrypoint``.

source: Let's not describe what each parameter does. But in general, ``entrypoint`` has create an event-loop, a four threads pool, set it for the current event-loop, has configure a colored logger with buffered output, and launched two services.
ru: Давайте не будем останавливаться на том, что делает каждый параметр. Но в целом, ``entrypoint`` создала цикл событий, пул из четырех потоков, настроила его для текущего цикла событий, настроила логгер с "цветным" буферизованным выводом и запустила два сервиса.

source: You can also run the ``entrypoint`` without services, just configure logging and so on.:
ru: Также вы можете запустить ``entrypoint`` без сервисов, просто сконфигурировать логирование и прочее:

source: It is also worth paying attention to the ``aiomisc.run``, which is similar by its purpose to ``asyncio.run`` while supporting the start and stop of services and so on.
ru: Еще стоит обратить внимание на ``aiomisc.run`` который похож по своему назначению на ``asyncio.run`` при этом поддерживает запуск и остановку сервисов и прочее.

source: import asyncio import logging import aiomisc async def sleep_and_exit(): logging.info("Started") await asyncio.sleep(1) logging.info("Exiting") aiomisc.run( # the first argument # is a main coroutine sleep_and_exit(), # Other positional arguments # is service instances OrdinaryService(), InfinityService(), # keyword arguments will # be passed as well to the entrypoint log_level="info" )
ru: import asyncio import logging import aiomisc async def sleep_and_exit(): logging.info("Started") await asyncio.sleep(1) logging.info("Exiting") aiomisc.run( # первый аргумент # это основная короутина sleep_and_exit(), # Другие позиционные аргументы # это экземпляры сервисов OrdinaryService(), InfinityService(), # другие именованные аргументы # будут просто переданы в entrypoint log_level="info" )

source: As I mentioned above, the library contains lots of already realized abstract services that you can use in your project by simply implement several methods.
ru: Как я и упоминал ранее библиотека содержит большое количество готовых абстрактных сервисов, которые вы можете использовать в своем проекте, просто реализовав несколько методов.

source: A full list of services and usage examples can be found on the on the :doc:`Services page </services>`.
ru: Полный список сервисов и примеры их использования можно найти на странице :doc:`Сервисы </services>`.

source: Executing code in thread or process-pools
ru: Выполнение кода в пуле потоков или процессов

source: As explained in `working with threads`_ section in official python documentation asyncio event loop starts thread pool.
ru: Как объясняется в разделе `working with threads`_ в официальной документации по Python, eventloop в asyncio запускает пул потоков.

source: This pool is needed in order to run, for example, name resolution and not blocks the event loop while low-level ``gethostbyname`` call works.
ru: Этот пул нужен для того, чтобы запустить, например, разрешение имен и не блокировать eventloop, пока работает низкоуровневый вызов `gethostbyname`.

source: The size of this thread pool should be configured at application startup, otherwise you may run into all sorts of problems when this pool is too large or too small.
ru: Размер этого пула потоков должен быть настроен при запуске приложения, иначе вы можете столкнуться со всевозможными проблемами, когда этот пул слишком велик или слишком мал.

source: By default, the ``entrypoint`` creates a thread pool with size equal to the number of CPU cores, but not less than 4 and no more than 32 threads. Of course you can specify as you need.
ru: По умолчанию ``entrypoint`` создает пул потоков с размером, равным количеству ядер процессора (минимум — 4, и максимум — 32). Конечно, вы можете указать столько, сколько вам нужно.

source: ``@aiomisc.threaded`` decorator
ru: Декоратор ``@aiomisc.threaded``
