Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/utils.po
Languages: ru

source: Utilities
ru: Утилиты

source: In some cases, you should wait for only one of multiple tasks. ``select`` waits first passed awaitable object and returns the list of results.
ru: Иногда требуется дождаться выполнения хотя-бы одной задачи из многих. ``select`` ожидает выполнения одной из переданных сопрограмм (или объектов с реализованным методом `__await__`) И возвращает список результатов.

source: When you don't want to cancel pending tasks pass ``cancel=False`` argument. In this case, you have to handle task completion manually or get warnings.
ru: В случае если вы не желаете отменять запущенные задачии передайте аргумент ``cancel=False``. Но в этом случае вам придется разобраться с завершением или отменой самостоятельон иначе будет предупреждение от интерпретатора.

source: All passed tasks will be canceled and the task will be returned:
ru: Все переданные задачи будут отменены, при это функция возвращает `asyncio.Task`:

source: Decorator wraps function and returns a function that returns awaitable object. In case a function returns a future, the original future will be returned. In case then the function returns a coroutine, the original coroutine will be returned. In case than function returns a non-awaitable object, it's will be wrapped to a new coroutine that just returns this object. It's useful when you don't want to check function results before use it in ``await`` expression.
ru: Оборачивает функции таким образом что они всегда возвращают сопрограмму. Если функция возвращает объект `asyncio.Future`, будет возвращен оригинальный объект. Если функция итак возвращает сопрограмму, или объект с реализованным методом `__await__` будет возвращен оригинальный объект.В противном случае возвращаемый объект будет тобернут в сопрограмму, которая вернет этот объект.Это полезно если не хочется проверять возврат из функции перед тем как использовать ее в `await` выражении.

source: Bind socket and set ``setblocking(False)`` for just created socket. This detects ``address`` format and selects the socket family automatically.
ru: Создает сокет и устанавливает для него необходимые для работы с asyncio флаги (вроде ``setblocking(False)``). Так-же определяет семейство адресов (IPv6/IPv4) из формата аргумента ``address`` автоматически.

source: Runs coroutine function periodically with user-defined strategy.
ru: Запускает сопрограммы переодически с определяемой пользователем стратегией.

source: The main purpose is this class is to provide ability to specify the asynchronous strategy function, which can be written very flexible.
ru: Основная цель этого класса - предоставить возможность указывать стратегией асинхронную функцию, которая может быть так как вам нужно.

source: Also, with the special exceptions, you can control the behavior of the started ``RecurringCallback``.
ru: Кроме того, с помощью специальных исключений вы можете управлять поведением запущенного ``RecurringCallback``.

source: if the strategy function returns an incorrect value (not a number), or does not raise special exceptions, the recurring execution is terminated.
ru: если функция-стратегия возвращает неверное значение (не число) или не вызывает специальных исключений, повторяющееся выполнение завершается.

source: Runs coroutine function periodically with an optional delay of the first execution. Uses ``RecurringCallback`` under the hood.
ru: Запускает сопрограммы переодически с заданным периодом времени, и необязательной задержкой при первом запуске. Использует ``RecurringCallback`` под капотом.

source: You have to install ``croniter`` package for use this feature:
ru: Придется установить пакет ``croniter`` чтобы пользоваться этим:

source: Or add extras when installing aiomisc:
ru: Или указать это как extras при установке aiomisc:

source: Runs coroutine function with cron scheduling execution. Uses ``RecurringCallback`` under the hood.
ru: Запускает сопрограммы переодически, как-будто с помощью cron.Использует ``RecurringCallback`` под капотом.
