Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/services/periodic.po
Languages: ru

source: Periodic Services
ru: Периодические сервисы

source: This section covers services for periodic and scheduled task execution.
ru: В этом разделе рассматриваются сервисы для периодического и запланированного выполнения задач.

source: ``PeriodicService`` runs ``PeriodicCallback`` as a service and waits for the running callback to complete on the stop method. You need to use ``PeriodicService`` as a base class and override ``callback`` async coroutine method.
ru: ``PeriodicService`` запускает ``PeriodicCallback`` как сервис и ожидает завершения выполняющегося колбэка при вызове метода stop. Вам нужно использовать ``PeriodicService`` как базовый класс и переопределить асинхронный метод ``callback``.

source: Service class accepts required ``interval`` argument - periodic interval in seconds and optional ``delay`` argument - periodic execution delay in seconds (0 by default).
ru: Класс сервиса принимает обязательный аргумент ``interval`` — интервал периодического выполнения в секундах, и опциональный аргумент ``delay`` — задержка перед первым выполнением в секундах (по умолчанию 0).

source: DNS Server
ru: DNS-сервер

source: The DNS server described here uses the ``aiomisc`` library, which provides utilities for asynchronous I/O operations, and the ``dnslib`` library for handling DNS records and packets. This setup is ideal for high-performance, non-blocking DNS query handling.
ru: Описанный здесь DNS-сервер использует библиотеку ``aiomisc``, которая предоставляет утилиты для асинхронных операций ввода-вывода, и библиотеку ``dnslib`` для обработки DNS-записей и пакетов. Такая конфигурация идеальна для высокопроизводительной неблокирующей обработки DNS-запросов.

source: Key Features
ru: Ключевые возможности

source: **Asynchronous I/O**: Utilizes asynchronous operations to handle multiple DNS queries concurrently, ensuring high performance and scalability.
ru: **Асинхронный ввод-вывод**: Использует асинхронные операции для параллельной обработки множества DNS-запросов, обеспечивая высокую производительность и масштабируемость.

source: **UDP and TCP Support**: Supports DNS queries over both UDP and TCP protocols, making it versatile for various network configurations.
ru: **Поддержка UDP и TCP**: Поддерживает DNS-запросы по протоколам UDP и TCP, что делает его универсальным для различных сетевых конфигураций.

source: **``EDNS0`` Support**: Implements Extension Mechanisms for DNS (``EDNS0``) to handle larger DNS messages and extended functionalities.
ru: **Поддержка ``EDNS0``**: Реализует механизмы расширения DNS (``EDNS0``) для обработки более крупных DNS-сообщений и расширенной функциональности.

source: **Customizable DNS Records**: Allows easy configuration of DNS zones and records, enabling you to define and manage your DNS entries efficiently.
ru: **Настраиваемые DNS-записи**: Позволяет легко настраивать DNS-зоны и записи, обеспечивая эффективное определение и управление DNS-записями.

source: Prerequisites
ru: Предварительные требования

source: Install the required libraries using pip:
ru: Установите необходимые библиотеки с помощью pip:

source: Setting Up the Server
ru: Настройка сервера

source: Testing the Server
ru: Тестирование сервера

source: You can test the DNS server using tools like ``dig``. For example, to query the A and AAAA records for ``test.``, use the following commands:
ru: Вы можете протестировать DNS-сервер с помощью таких инструментов, как ``dig``. Например, для запроса записей A и AAAA для ``test.`` используйте следующие команды:

source: These commands should return the IP addresses ``10.10.10.10`` and ``fd10::10`` respectively, confirming that the DNS server is working correctly.
ru: Эти команды должны вернуть IP-адреса ``10.10.10.10`` и ``fd10::10`` соответственно, подтверждая корректную работу DNS-сервера.

source: Dynamic Store Management
ru: Динамическое управление хранилищем

source: One of the powerful features of this DNS server setup is the ability to dynamically manage the DNS store. This allows you to add or remove zones and records at runtime, without needing to restart the server.
ru: Одной из мощных возможностей этой конфигурации DNS-сервера является возможность динамического управления DNS-хранилищем. Это позволяет добавлять или удалять зоны и записи во время работы, без необходимости перезапуска сервера.

source: Managing DNS zones and records dynamically is essential for a flexible DNS server setup. This guide focuses on how to manipulate DNS zones and records using the ``DNSStore`` and ``DNSZone`` classes, providing practical examples for each operation.
ru: Динамическое управление DNS-зонами и записями необходимо для гибкой настройки DNS-сервера. Это руководство посвящено работе с DNS-зонами и записями с использованием классов ``DNSStore`` и ``DNSZone``, с практическими примерами для каждой операции.

source: Adding a Zone
ru: Добавление зоны

source: You can add a new zone to the ``DNSStore`` to manage its records. This operation ensures that the zone is available for DNS queries.
ru: Вы можете добавить новую зону в ``DNSStore`` для управления её записями. Эта операция обеспечивает доступность зоны для DNS-запросов.

source: Removing a Zone
ru: Удаление зоны

source: Removing a zone from the ``DNSStore`` ensures it is no longer available for DNS queries.
ru: Удаление зоны из ``DNSStore`` гарантирует, что она больше не будет доступна для DNS-запросов.

source: Adding a Record to a Zone
ru: Добавление записи в зону

source: To manage DNS entries, you can add records to a specific zone. This operation makes the record available for DNS resolution within that zone.
ru: Для управления DNS-записями вы можете добавлять записи в определённую зону. Эта операция делает запись доступной для DNS-разрешения в этой зоне.

source: Querying Records
ru: Запрос записей

source: You can query the ``DNSStore`` to retrieve records for a specific domain name. This is useful to verify if a record exists or to handle DNS queries.
ru: Вы можете запрашивать ``DNSStore`` для получения записей для определённого доменного имени. Это полезно для проверки существования записи или обработки DNS-запросов.

source: Handling Duplicate Zones
ru: Обработка дублирующихся зон

source: Attempting to add a zone that already exists should raise an error, ensuring that each zone is unique within the ``DNSStore``.
ru: Попытка добавить уже существующую зону должна вызвать ошибку, гарантируя уникальность каждой зоны в ``DNSStore``.

source: Removing a Nonexistent Zone
ru: Удаление несуществующей зоны

source: Removing a zone that does not exist should raise an error, indicating that the operation is invalid.
ru: Удаление несуществующей зоны должно вызвать ошибку, указывающую на недопустимость операции.

source: Querying Subdomains
ru: Запрос поддоменов

source: The ``DNSStore`` supports querying subdomains, allowing you to resolve records within subdomains of an existing zone.
ru: ``DNSStore`` поддерживает запрос поддоменов, позволяя разрешать записи в поддоменах существующей зоны.

source: Retrieving a Zone
ru: Получение зоны

source: You can retrieve a zone from the ``DNSStore`` to inspect or manipulate it further.
ru: Вы можете получить зону из ``DNSStore`` для дальнейшего просмотра или изменения.

source: Handling Nonexistent Zones
ru: Обработка несуществующих зон

source: Retrieving a zone that does not exist should return ``None``.
ru: Получение несуществующей зоны должно вернуть ``None``.

source: Removing a Record from a Zone
ru: Удаление записи из зоны

source: To remove a DNS record from a zone, you can use the ``remove_record`` method. This operation ensures the record is no longer available for DNS resolution.
ru: Для удаления DNS-записи из зоны можно использовать метод ``remove_record``. Эта операция гарантирует, что запись больше не будет доступна для DNS-разрешения.

source: Finding Zone by Prefix
ru: Поиск зоны по префиксу

source: The ``DNSStore`` can find the appropriate zone for a given domain name, which is useful for handling queries with subdomains.
ru: ``DNSStore`` может найти подходящую зону для заданного доменного имени, что полезно для обработки запросов с поддоменами.

source: ``CronService`` runs ``CronCallback's`` as a service and waits for running callbacks to complete on the stop method.
ru: ``CronService`` запускает ``CronCallback`` как сервис и ожидает завершения выполняющихся колбэков при вызове метода stop.

source: It's based on croniter_. You can register async coroutine method with ``spec`` argument - cron like format:
ru: Основан на croniter_. Вы можете зарегистрировать асинхронный метод с аргументом ``spec`` в cron-подобном формате:

source: requires installed croniter_:
ru: требуется установленный croniter_:

source: or using extras:
ru: или с использованием extras:

source: You can also inherit from ``CronService``, but remember that callback registration should be performed before start
ru: Вы также можете наследоваться от ``CronService``, но помните, что регистрация колбэков должна выполняться перед запуском
