Repository: aiokitchen/aiomisc
Catalog: docs/source/locale/*/LC_MESSAGES/services/web.po
Languages: ru

source: Web Services
ru: Веб-сервисы

source: This section covers web-related services including aiohttp, ASGI, and Uvicorn.
ru: В этом разделе рассматриваются веб-сервисы, включая aiohttp, ASGI и Uvicorn.

source: aiohttp service
ru: Сервис aiohttp

source: requires installed aiohttp:
ru: требуется установленный aiohttp:

source: or using extras:
ru: или с использованием extras:

source: aiohttp application can be started as a service:
ru: Приложение aiohttp может быть запущено как сервис:

source: Class ``AIOHTTPSSLService`` is similar to ``AIOHTTPService`` but creates an HTTPS server. You must pass SSL-required options (see ``TLSServer`` class).
ru: Класс ``AIOHTTPSSLService`` аналогичен ``AIOHTTPService``, но создаёт HTTPS-сервер. Необходимо передать параметры SSL (см. класс ``TLSServer``).

source: asgi service
ru: Сервис ASGI

source: requires installed aiohttp-asgi:
ru: требуется установленный aiohttp-asgi:

source: Any ASGI-like application can be started as a service:
ru: Любое ASGI-приложение может быть запущено как сервис:

source: Class ``ASGIHTTPSSLService`` is similar to ``ASGIHTTPService`` but creates HTTPS server. You must pass SSL-required options (see ``TLSServer`` class).
ru: Класс ``ASGIHTTPSSLService`` аналогичен ``ASGIHTTPService``, но создаёт HTTPS-сервер. Необходимо передать параметры SSL (см. класс ``TLSServer``).

source: uvicorn service
ru: Сервис uvicorn

source: requires installed uvicorn:
ru: требуется установленный uvicorn:

source: Any ASGI-like application can be started via uvicorn as a service:
ru: Любое ASGI-приложение может быть запущено через uvicorn как сервис:
